[
    {
        "title": "Trump's deflating Tulsa turnout reveals a deeper problem for him",
        "url": "https://www.nbcnews.com/politics/politics-news/trump-s-deflating-tulsa-turnout-reveals-deeper-problem-him-n1231664",
        "image": "https://media3.s-nbcnews.com/j/newscms/2020_25/3391549/200620-donald-trump-rally-analysis-cs-1040p_94f7574fa9292a6f1dda671a90a205a9.nbcnews-fp-1200-630.jpg",
        "content": " WASHINGTON — President Donald Trump was supposed to get a boost Saturday from his first campaign rally since late February. Instead, he got a bust. After bragging earlier in the week that more than 1 million people had signed up to come see him, Trump found that he couldn't fill a 19,000-seat arena in a state where he won by 36 percentage points and on a night that his aides had promoted as a major show of his strength. The sparse crowd in Tulsa, Oklahoma, was more than just a humiliation for Trump. It weakened a key argument of his re-election narrative. To explain how he might be able to win despite poor polling numbers — and amid national crises — he has posited that a \"silent majority\" of Americans back him. \"The silent majority is stronger than ever before,\" Trump said Saturday night. But the poor turnout suggests just the opposite — that enthusiasm for him is weaker than it appears. That isn't likely to sit well with Trump, who gambled that his backers were so loyal they would brave the risk of spreading coronavirus to see him in person. His bet backfired. Rather than receiving a jolt of energy, Trump got a dose of reality. Worse yet, for the president, it was delivered at a time when he desperately needs to reset the frame of the election. This site is protected by recaptcha Privacy Policy | Terms of Service For most of the last four months, when Trump had expected to tour the country in service of his re-election, he has been running a Rose Garden campaign. Most Americans don't approve of his handling of the coronavirus, his response to nationwide protests against systemic racism, or both. And his rival, presumptive Democratic presidential nominee Joe Biden, has seized a sizable polling lead. To get him out of the West Wing doldrums and back into fighting mode, his political team had planned a rally that would re-energize him by demonstrating the commitment of the Trump faithful. It was so important that he went forward with it despite having to move the date so that it wouldn't conflict with Juneteenth. Charlie Kirk, founder of the pro-Trump student group Turning Point USA, said afterward on Fox News that it had been \"too long\" since the president had held one of his signature events. \"It’s so refreshing to see the president back in front of his base,\" Kirk said, channeling the thinking of many Trump allies. \"Finally, he’s back on offense, putting the Democrats on defense.\" But while Trump delivered a series of broadsides to adversaries real and imagined — he devoted more than 10 minutes to enumerating excuses for why he had difficulty descending a ramp while at West Point last week — it was difficult, at times, to tell exactly which side he was taking. \"They want to demolish our heritage so they can impose their new oppressive regime in its place,\" Trump said of the removal of statues to Confederate leaders in the wake of protests against police killings of Black men and women. A little bit later, he claimed to have \"done more for the Black community in four years\" than Biden ever has. It was a boastful night for the president, who also praised himself for the federal response to coronavirus. \"I have done a phenomenal job with it,\" he said. \"I saved hundreds of thousands of lives. We don't ever get a mention.\" Epidemiologists say that the U.S. death toll would have been much lower if the president and other government officials had pushed policies like social distancing sooner. All in all, Trump's hour-plus speech sounded familiar in its mix of grievance, self-congratulation and invective against political adversaries. But what was notably different from typical Trump rallies was the muted reaction from the audience. The one thing Trump needed more than anything, he didn't get. There were no deafening chants of \"build the wall\" or other crowd favorites. He wasn't often forced to pause for applause. And, with his upper lip and cheek shining for most of the night, Trump appeared to be working hard to sustain the modest energy in the room. That should have served as a reality check for him: right now, his supporters amount to less of a \"silent majority\" than an absent minority."
    },
    {
        "title": "Kurt Cobain's MTV Unplugged guitar sells for $6m",
        "url": "http://www.bbc.co.uk/news/world-us-canada-53128416",
        "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5B19/production/_113012332_203c52c5-72b3-4758-b0e5-b06f4cf6eb79.jpg",
        "content": " A guitar played by Nirvana frontman Kurt Cobain in a rare acoustic concert has sold for a record $6m (£4.9m). Cobain played the retro acoustic-electric 1959 Martin D-18E during a legendary MTV Unplugged performance in 1993, just five months before he died. At $6.01m after fees, the guitar is the most expensive ever sold at auction, Julien's Auctions said. Bidding in Los Angeles opened at $1m and was won by Rode Microphones founder Peter Freedman. Nirvana's acoustic performance for the MTV Unplugged series on 18 November 1993 is now considered one of history's greatest live performances. Mr Freedman said he planned to take the guitar on a worldwide tour, with proceeds to go to supporting the performing arts. He described buying the guitar as \"a once-in-a-lifetime opportunity\", according to the auction house. The guitar came with its case, which Cobain had decorated with a poster from the band Poison Idea's 1990 album Feel the Darkness. Before this, the most expensive guitar sold in history was a Fender Stratocaster used by Pink Floyd guitarist David Gilmour. It fetched almost $4m at a charity sale in June 2019."
    },
    {
        "title": "Donald Trump's heartless week",
        "url": "http://us.cnn.com/2020/06/21/opinions/trump-heartless-week-opinion-weekly-column-galant/index.html",
        "image": "https://cdn.cnn.com/cnnnext/dam/assets/200618224916-donald-trump-file-0615-super-tease.jpg",
        "content": " This week the question of presidential compassion was a consistent storyline.  You could pick your lyrics: Was the President like the Tin Man from the \"Wizard of Oz,\" plaintively singing, \"If I only had a heart.\" Or was he suffering from, as the 80s hit song put it, \"a total eclipse of the heart\"? We saw a President who slammed the Supreme Court for blocking his effort to subject 650,000 Dreamers to deportation. He also bemoaned the court's historic ruling Monday that LGBT people can't be fired because of their sexuality. His former national security adviser John Bolton claimed in a book excerpt that Trump had encouraged China's leader to set up concentration camps for the Uyghur minority. He plowed ahead with a non-socially distanced rally in Tulsa, Oklahoma, even as coronavirus cases mounted.  Yes, some rallygoers could get sick, Trump told the Wall Street Journal, but \"it's a very small percentage.\" In a private meeting with the families of Black victims, though, Trump was \"very compassionate,\" according to the mother of Ahmaud Arbery, who was shot to death while jogging in Georgia.   But in his public remarks, the President made law-and-order his primary message. \"Trump went on the attack against his political rivals and doubled down on his hard-line, 'law and order' stance, a political calculation solidified by his use of the words 'safety and security' and his statement that Americans 'demand law and order,'\" wrote Issac Bailey. \"His effort to address growing national suffering and protest over police brutality was, at best, a thinly veiled excuse to defend law enforcement and signal to white voters where he stands.\"  A chilling view of the private Trump emerged from the Bolton book. It painted a credible \"portrait of the most amoral, autocratic and unprepared man to ever serve as president of the United States,\" wrote John Avlon. \"This is not a partisan attack by activists from the opposition party. This is the first-person view of the President's former national security adviser, bolstered by contemporaneous notes, a standard which is admissible in court. It is a damning portrait of a president untethered to anything resembling morals, who cannot separate his self-interest from the national interest and doesn't even care to try.\" Jen Psaki viewed the book through the lens of the upcoming election: \"All of the observations, accusations and specific anecdotes are about one person -- Donald Trump -- and whether he is fit to lead the country and the lasting damage he would inflict if given four more years.\"  In fact, the revelations show Bolton as complicit, in Elie Honig's view: \"John Bolton has offered the nation a staggering profile in cowardice...Bolton directly witnessed not one but multiple acts that could have been cited in the impeachment of President Donald Trump. But Bolton did nothing about it while he held a powerful post in the Trump administration. And he stayed quiet and took cover when Congress and the nation pleaded with him to speak out during the impeachment process.\" Writing about China policy, Bolton gave this devastating description: \"The Trump presidency is not grounded in philosophy, grand strategy or policy. It is grounded in Trump.\" As if to prove that such a verdict applies more broadly, on Friday night Attorney General William Barr ousted Geoffrey Berman, US Attorney for the Southern District of NY which has been investigating and prosecuting Trump's associates. \"The news of Berman's ouster is one more piece of evidence that Trump is the anti-law-and-order President, despite his claims to the contrary. Trump touts law and order when it suits him, but attacks the courts and erodes our judicial system when it comes to his agenda and actions,\" wrote Julian Zelizer.  One critic described Bolton's book as a slog. \"It toggles between two discordant registers: exceedingly tedious and slightly unhinged,\" wrote Jennifer Szalai in the New York Times. \"Still, it's maybe a fitting combination for a lavishly bewhiskered figure whose wonkishness and warmongering can make him seem like an unlikely hybrid of Ned Flanders and Yosemite Sam.\"  Another book Trump may be dreading is due out in July from the President's niece, Mary L. Trump, who is a psychologist. Trump biographer Michael D'Antonio wrote that the book promises to shed light on the President's fraught relationships with his father and elder brother, Fred Trump Jr., who was Mary Trump's father. \"Three and a half years into the Trump era, endless words have been spent illustrating the chaotic and cruel personality that can, to cite just one example, schedule a huge ego-gratifying rally in the middle of a deadly pandemic caused by a viciously contagious virus,\" noted D'Antonio.  A rally fizzles Given that cases of Covid-19 have been rising sharply in Tulsa County, wrote infectious disease expert and Oklahoma native Dr. Kent Sepkowitz in advance of Trump's Saturday rally there, \"from a strict public health perspective, the selection of Tulsa is a terrible decision.\"  Trump's first rally since the pandemic began was \"supposed to trumpet his return to greatness -- and the country's return to normalcy,\" wrote Frida Ghitis. But it \"instead brought embarrassing scenes of empty bleachers, a dismantled stage and a familiar speech unsuccessfully trying to reignite public fears...The speech was typically self-centered, with a bizarre more than ten-minute long riff on his ultra-slow descent from the West Point ramp, and absolutely no words of compassion for the nearly 120,000 people in this country who have died during the pandemic.\" Days of freedom Friday was Juneteenth, the holiday celebrating the end of slavery in the US. Another historic day of freedom came on October 1, 1962, when James Meredith became the first African American student to enroll at the University of Mississippi. He had to sue for his right to an education there, and it took the courts, hundreds of federal marshals and thousands of troops to overcome rioting and protect Meredith.   \"The gates of higher education in the United States were opened for all Americans,\" Meredith wrote. \"This victory for me and for the US Constitution shattered the system of state-sponsored white supremacy in Mississippi...\" \"When I see people across America -- and around the world -- peacefully marching for racial justice and honoring the memory of George Floyd and other martyrs like Medgar Evers...I am filled with both joy and hope. White supremacy may be the most evil beast that's ever stalked the halls of history, and today it may finally be mortally wounded.\"  Some companies and some states marked Juneteenth as a holiday, but it should be observed nationally, wrote Peniel Joseph. It \"would spur not only conversation about the origins of our current racial and political conflicts, but would also prompt vitally necessary education about white supremacy and its manifestations in policies and political actions that are anti-Black, anti-democratic and anti-human,\" wrote Joseph.  Rayshard Brooks' own words Months before he was shot to death by Atlanta police, Rayshard Brooks took part in an interview for a research project. A video of that February interview aired on CNN's Anderson Cooper 360 show Wednesday, and in it, Brooks described the lasting burden of being on probation: \"I just feel like some of the system could, you know, look at us as individuals. We do have lives, you know, just a mistake we made, and you know, not just do us as if we are animals.\" Van Jones noted that for people on probation \"any contact with a police officer -- for any reason -- means an almost certain return to the horrors of a jail cell. It is safe to assume that Brooks did not want to go back to jail over sleeping in his car or failing a sobriety test, lose everything he had and be forced to start his life over again.\" \"In other words, we do not know why the Atlanta police officer chose to shoot a man who was running away from him. But we can guess why that man chose to run, in the first place. Brooks didn't want to lose his liberty. Instead, he wound up losing his life.\" Melvin Carter, the first African American mayor of St. Paul, Minnesota, is the son of a police officer who served his city for 28 years. But even with that background, he doesn't think the answer to public safety is solely a matter of spending billions on police and prisons. \"Our country's enforcement-heavy approach to safety isn't designed to address the root causes of crime, but the symptoms,\" he wrote. \"Instead of equipping us all with tools to guard our own future security, it further alienates those on the outer edges of society and impedes funding for critical social infrastructure like schools and housing.\"  A former mayor, Mitch Landrieu of New Orleans, wrote that the US Justice Department was investigating his city's police department when he took office. A consent decree which is still ongoing has resulted in a dramatic improvement in how residents view the police, but there's more work to be done, Landrieu wrote. \"We must go further. We can no longer ask police to handle the failures of our social and educational systems.\"  Anne Milgram, the former New Jersey Attorney General, worked on the reinvention of policing in what was once America's most dangerous city, Camden. \"We had a police department that had no idea of what it was doing or whether it could do better. It lurched wildly from 911 call to 911 call, sometimes taking hours to respond to calls of serious violence. It failed to solve serious crimes...that plagued the city, and yet hundreds of arrests were being made for low-level crimes, driven most often by drug and alcohol addiction, mental illness, poverty and homelessness.\" New leadership, new systems and ultimately a new police department made a difference -- the city is \"the safest that it has been in more than 50 years\" and the police department is a model for others, Milgram wrote. Supreme surprises When Donald Trump ran for President, he promised to appoint conservative justices to the federal courts -- and he's been true to his word, naming Brett Kavanaugh and Neil Gorsuch to the Supreme Court and scores of others for lower courts. But it was Gorsuch who wrote the majority opinion this week upholding civil rights for LGBTQ Americans, rejecting the Trump administration's position in declaring that the anti-discrimination provisions of the 1964 Civil Rights Act protect gay and transgender people. \"It's surprising that it's taken this long,\" wrote John Sutter. \"Until this week in the United States of America, many LGBTQ workers lacked these simple legal protections.  \"In over half the states in America, you could be fired for being gay. Until now.\"  Then on Thursday, Chief Justice John Roberts, appointed by George W. Bush, sided with the court's four liberals in blocking the Trump administration's effort to kill the Obama-era DACA program, which shields young people who had been brought to the United States as children from deportation. DACA \"was life-changing for hundreds of thousands of people — Americans in all but the paperwork — who were now free to work, go to school, seek promotions and continue their academic careers without fear of being detained and sent back to countries they barely knew,\" wrote Raul Reyes. The decision was \"a win for Dreamers, for the American ideal of welcoming immigrants — and for the independence of the high court.\" Happy Father's Day Mother's Day this year came as most Americans were still locked down, and a lot of the holiday get-togethers were virtual. Today is Father's Day and the advice from Kent Sepkowitz is consistent with what he recommended for the earlier holiday: get together with your father on Zoom, Facetime or whatever platform you prefer. America's \"approach to reopening -- which has been unscientific and uncoordinated -- has failed miserably. Rather than cautiously peeling back the various Covid-19 containment safeguards, most states have supported an 'everybody-back-in-the-pool' return, as if we were all teens partying during Spring Break.\" \"Besides, let's be honest -- Father's Day is no Mother's Day, \"wrote Sepkowitz, noting that total US spending on Mother's Day gifts is more than 50% higher. \"As a dad myself, this junior varsity status is fine by me. This year in particular, I want nothing to do with celebrating a holiday in the middle of a poorly managed pandemic.\" For more on Father's Day:  Marcus Mabry: A Father's Day message to all dads  Arick Wierson: George Floyd was my wake-up call  After Aunt Jemima The debate over systemic racism touched off by the killing of George Floyd rippled into many parts of America. Consumer-facing companies reacted, with Quaker Oats announcing that it would end the 131-year-old Aunt Jemima brand, noted Elliot Williams.  As a Black child, it was upsetting for him to discover that the light-pink Crayola crayon was labeled \"flesh\" colored. \"I put it back in the bin, pulled out 'burnt sienna' or 'raw umber' and continued whatever (probably \"Star Wars\" themed) self-portrait I was working on... By implying that the only color called 'flesh' looked like white skin, Crayola decided who was 'normal.' Everyone else had to work around that.\" (The \"flesh\" color was phased out in 1962, replaced by \"peach.\") \"In the midst of a national debate on life-and-death matters around racism and public safety, fussing about the logo on instant rice may seem trivial,\" Williams wrote. \"It's not. The images our society chooses to elevate are reflective of who we are, and more importantly, whose voices -- and yes, even lives -- matter.\"  Now that Aunt Jemima has been retired, wrote Crystal Echo Hawk, what should be next? She argued that the many uses of Native American images and symbolism in sports must end. \"Professional sports have the power to influence and inspire people of all ages. In this unprecedented moment of solidarity, they have the opportunity to take a strong stand and show -- not just say -- that racism will not be tolerated.\" Covid-19 is still here America's top two elected officials did their best this week to argue that Covid-19 is going away, despite clear signs to the contrary. \"Other countries whose governments addressed the crisis forthrightly have managed to wrestle down the curve, and now they are carefully, safely reopening,\" wrote Frida Ghitis. \"In the US, the curve is trending up, not down, even if Vice President Mike Pence deceptively declared in an op-ed this week, 'We are winning the fight against the invisible enemy,' unctuously declaring that the good news is 'a testament to the leadership of President Trump.'\" As Ghitis noted, \"On Monday, during a roundtable discussion on senior citizens, Trump said 'If you don't test, you don't have any cases,' a belief reminiscent of a baby thinking you disappear if he covers his eyes. To state the obvious, if we stopped testing, people would continue to become infected and die.\" Don't miss: Kamala Harris: The fight continues to protect Americans' health care from Trump.  Theodore Boutrous Jr.: Trump's tweet exploits and defames toddlers Vicky Ward: Telling the truth makes a huge difference  David Gergen and Caroline Cohen: The next Greatest Generation Merrill Brown: Federal government abdicates duty to inform public on coronavirus Claire McMullen, Yael Schacher and Ariana Sawyer: Trump's cold-blooded move to shut out desperate asylum seekers Jeff Yang: It turns out your favorite movie is racist. What now? Nayyera Haq: Why Stacey Abrams deserves applause AND... At last, summer A summer like no other begins this weekend. In the first of a new series of weekly columns for CNN Opinion, biologist Erin Bromage wrote, \"Our choices over the coming months will determine the trajectory of this pandemic. If we continue to pursue activities that pose a high risk for infection, such as large indoor gatherings, then we will hear the roar of that second wave sooner than later.\"  \"If we take a more measured approach, by improving hand hygiene, limiting daily interactions with other people, maintaining physical distance and increasing face mask use when we can't maintain the distance, then businesses can operate safely, people can return to work and the activities our children are missing can resume.\" But even in the midst of the pandemic, Bromage wrote that he's looking forward to some traditional summer activities: \"my first meal at a restaurant (dining outdoors), visiting with more than one or two households at a time, and spending time at the beach. These interactions will be a little different than last summer. \"We will have to keep personal risks and risk mitigation measures in mind, but these adjustments are well worth the payoff of getting to enjoy some of my family's usual summertime activities.\""
    },
    {
        "title": "Reading park stabbings: What we know so far",
        "url": "http://www.bbc.co.uk/news/uk-53124359",
        "image": "https://ichef.bbci.co.uk/images/ic/1024x576/p08hlr6z.jpg",
        "content": " Three people are dead and at least three others have been injured after stabbings in a park in Reading. Police have said they are treating the attack as a \"terrorist incident\". Police were called to Forbury Gardens at about 19:00 BST following reports that a number of people had been stabbed. Thames Valley Police said a 25-year-old man from Reading was arrested at the scene and is now in custody on suspicion of murder. There are reports that a police officer \"rugby tackled\" the suspect to the ground, according to the Sunday Mirror. The head of counter terrorism policing, Metropolitan Police Assistant Commissioner Neil Basu, thanked \"unarmed and incredibly brave\" officers for detaining the suspect. He added that the attack was unrelated to a peaceful Black Lives Matter protest held hours earlier in the park, and that members of the public had provided emergency first aid to victims in the immediate aftermath. South Central Ambulance Service said \"multiple ambulance resources\" were sent to the scene, including five ambulance crews and a helicopter. Early reports suggested that three people had suffered serious injuries. However, it was later confirmed that two people had been taken to Royal Berkshire Hospital in Reading. One person remains under observation with non life-threatening injuries, and a second person has been discharged, the hospital said. About a dozen armed police officers with shields were later seen entering a block of flats in Basingstoke Road in Reading at about 23:00 BST, and families living in the building were moved out. A loud bang was heard from the flats later at about 12:30, and the armed officers have now left the scene. Police were initially treating the attack as a murder investigation, not a terrorism incident. However, officers confirmed shortly before 11:30 BST on Sunday that it was being treated as a \"terrorist incident\". In a statement, Thames Valley Police said that counter terrorism officers would be taking over the investigation. Officers are not looking for any other people in connection with this incident and say there is no intelligence to suggest that there is any further danger to the public. Earlier security sources told the BBC the 25-year-old man arrested at the scene is thought to be Libyan. Home Affairs correspondent Daniel Sandford said he had been told the suspect had previously been in prison in the UK but for a relatively minor offence, not a terrorism offence. Metropolitan Police Assistant Commissioner Neil Basu said that the \"motivation for this horrific act is far from certain\". Eyewitness Laurence Wort, 20, told the BBC that he was visiting Reading for the day and was about 10m from the attack. \"The park was pretty full, a lot of people sat around drinking with friends when one lone person walked through, suddenly shouted some unintelligible words and went round a large group trying to stab them. \"He stabbed three of them and then turned and started running towards me, when we turned and started running. \"When he realised that he couldn't catch us he tried to stab another group sat down. \"He got one in the back of the neck and then when he realised everyone was starting to run, he ran out the park.\" Claire Gould, a freelance journalist who lives in Reading, said she walked past Forbury Gardens at around 18:40 BST \"and everything seemed calm\".  She then saw an air ambulance land in King's Meadow - another park close to the scene - at around 19:00 BST, followed by a second around 10 minutes later. \"There were multiple sirens from 19:00 going on for the next couple of hours and police helicopters [were] circling,\" she added. Prime Minister Boris Johnson initially tweeted to say that his \"thoughts are with all of those affected by the appalling incident in Reading\". In a later interview on Sunday, the PM said that he was \"appalled and sickened that people should lose their lives in this way\". He added: \"If there are lessons that we need to learn about how we handle such cases, how we handle the events leading up to such cases, then we will learn those lessons - and we will not hesitate to take action when necessary.\" Asked what action he was suggesting, he replied: \"If there are changes that need to be made to our legal system to stop such events happening again, we will not hesitate to take that action - as we have before, you will recall, over the automatic early release of terrorist offenders\". Home Secretary Priti Patel tweeted: \"This evening we saw a senseless attack on people simply enjoying a Saturday with family and friends. \"My heart, prayers and thoughts are with all those affected.\" Policing minister Kit Malthouse has described the incident as \"horrific\" and \"dreadful\". Labour leader Sir Keir Starmer said the stabbing was \"very concerning\". Reading Borough Council leader Jason Brock said the town was \"an incredibly strong community\" where \"people will come together and they won't allow themselves to be divided\". Reading East MP Matt Rodda called it the \"most dreadful incident\".  He added: \"This will come as a real shock to our community and I think what's happening now is people are pulling together and trying to support one another at this dreadful time.\""
    },
    {
        "title": "Trump navigates a DACA dilemma with mixed messages after Supreme Court defeat",
        "url": "https://www.nbcnews.com/politics/2020-election/trump-navigates-daca-dilemma-mixed-messages-after-supreme-court-defeat-n1231612",
        "image": "https://media3.s-nbcnews.com/j/newscms/2020_25/3391358/200619-donald-trump-2019-ac-448p_357b16f23dabc8aed1b97f8bf2ada3d9.nbcnews-fp-1200-630.jpg",
        "content": " WASHINGTON — When President Donald Trump revoked the Deferred Action for Childhood Arrivals program in 2017, he said he had “great heart” for the young people it protects. When the Supreme Court blocked his move Thursday, declaring that he didn't follow the right procedure, Trump blasted the ruling and vowed to try again to end the program — all while insisting it was Democrats who have “abandoned” the so-called Dreamers. The sequence captures Trump’s shifting and at times incoherent posture on the Obama-era program that temporarily shields young people brought to the U.S. illegally as children from deportation. The ruling threw the politically charged issue back in Trump’s lap five months before the election. Polls show DACA is popular with Americans, including large numbers of Republicans. But Trump’s anti-immigration vision is a source of passionate support from his conservative base, which sees him as a rare politician willing to take tough positions. Some prominent Trump backers say he has more to lose by leaving DACA alone. “The president would pay a greater political cost for not pursuing the DACA wind-down, because in the past couple months he’s been pretty weak and perceived as weak by his own supporters,” said Mark Krikorian, an activist for cutting immigration who leads the Center for Immigration Studies. “He’s in real danger of demoralizing his supporters by showing weakness and impotence,” he said. “And not pursuing this could reinforce that. That’s a greater danger than somehow being seen as mean and heartless for revoking this program. Anybody who thinks that already doesn’t like him.” A CBS News poll in 2018 showed 87 percent of Americans want brought unlawfully as children to be allowed to stay in the U.S. A Pew Research Center poll this month showed 74 percent believe they should receive permanent legal status. At his first rally in months Saturday in Tulsa, Oklahoma, Trump portrayed the Supreme Court ruling as merely a bump in the road and promised to refile the paperwork to end DACA. But he also insisted that the beneficiaries would be protected without saying how. This site is protected by recaptcha Privacy Policy | Terms of Service \"We didn't lose. We're going to refile it, and everything is going to work out for the young people — most of whom aren't so young anymore, by the way. But we're going to work it out for everybody,\" Trump said, before changing the topic. While it isn't the top issue for most voters, presumptive Democratic nominee Joe Biden has sought to use it to paint Trump as lacking compassion. He said Thursday that attempt to end DACA would make Trump \"responsible for upending the lives of hundreds of thousands of young people and bringing harm to families and communities all across the country.\" In a statement, Biden promised to send Congress a bill on “day one” of his presidency to make DACA protections permanent. Congressional Democrats support a standalone bill to give the young immigrants a path to citizenship. According to a Fox News poll released Thursday, U.S. registered voters said by a 20-point margin that Trump doesn't care about people like them. By contrast, they said by a 6-point margin that Biden does care about people like them. It is a key metric for many voters that Biden is counting on. Two consistencies of Trump's presidency have been his inclination to use his executive powers to curtail immigration where possible and to undo President Barack Obama's actions. DACA fits the sweet spot. María Teresa Kumar, president of the pro-immigration activist group Voto Latino, said Trump's opposition to relief for DACA recipients is clear in his actions. \"He keeps trying to hoodwink us, but we have the receipts of what he really means,\" she said. \"He's speaking from both sides of his mouth but really winking at his Fox News audience and saying 'I don’t really believe any of this.'\" In 2016, Trump rallied right-wing voters with a promise to \"immediately terminate President Obama's two illegal executive amnesties.” After taking office the following year he hesitated for months to revoke the program and pulled the trigger in September before his actions got tangled up in court. Trump then called on Congress to codify DACA into law, saying he’d defer to lawmakers and enact what they come up with. He soon shifted that position by adding demands of his own. In 2018, he rejected a bipartisan proposal by Sen. Mike Rounds, R-S.D., and Sen. Angus King, I-Maine to give DACA recipients a path to citizenship and secure $25 billion to build his border wall. Trump threatened to veto it for failing to include cuts to family-based legal immigration and the diversity green card lottery, prompting Senate GOP leaders to oppose it. In the end only eight Republicans backed it and it gained 54 votes, short of 60 needed. Meanwhile, a Trump-backed bill that included those provisions won just 39 votes in the Senate. The Supreme Court ruling on DACA has yielded mixed reaction from Republicans. Sen. Cory Gardner, R-Colo., who’s in the middle of a difficult re-election bid, said the Senate should pass the Democratic-backed Dream Act. Sen. Martha McSally, R-Ariz., also politically vulnerable, said the Senate should “do what is right and solve this issue with thoughtful legislation” without getting into detail. On the other side of the divide, Sen. Ted Cruz, R-Tex., tore into DACA as a program that was created illegally and should never have existed. Sen. Josh Hawley, R-Mo., said the DACA ruling marked \"most disappointing week at #SCOTUS in years.\" Krikorian said Trump believes DACA cannot continue as it will “just encourage more DACAs in the future.” “Amnestying these people will create externalities,” he said. “And dealing with that fallout has to be part of the legislation.”"
    }
]