[
    {
        "title": "Millions return to lockdown in Philippines",
        "url": "http://www.bbc.co.uk/news/world-asia-53646149",
        "image": "https://ichef.bbci.co.uk/news/1024/branded_news/9088/production/_113800073_tv062769313-1.jpg",
        "content": " Tens of millions of people in the Philippines are back in lockdown, after doctors warned a surge in new coronavirus cases could push the healthcare system to collapse. Stay-at-home orders are now in place in Manila and four surrounding provinces on the island of Luzon for two weeks. The country only just emerged from one of the strictest lockdowns in June. But hospitals have been struggling to cope with a five-fold rise in confirmed infections, now surging past 100,000. The lockdown means a return to stay-at-home orders except for going out to buy essential goods or exercising outdoors. Public transport has also been suspended and domestic flights are grounded, while restaurants are restricted to takeaways. The new lockdown came after 80 medical associations on Saturday called on President Rodrigo Duterte to toughen restrictions in a bid to slow the spread of the virus. On Sunday the Philippines announced a record 5,032 new infections. In some areas hospitals are reported to have been forced to turn away soaring numbers of patients. Doctors hope the reinstated restrictions will now give medical workers more time to deal with the spike in cases. With only 24 hours notice of the shutdown, which took effect on Tuesday, many people have found themselves stranded in the capital without any transport to return to their hometowns. We've run out of money. We can't leave the airport because we don't have any relatives here, Ruel Damaso, a 36-year-old construction worker, told AFP. He was trying to return to the southern city of Zamboanga. In other parts of Manila people were seen stockpiling food the day before restrictions began as they prepared to stay indoors for a second time. The earlier shutdown from mid-March to May was one of the world's longest stay-at-home orders. There have been 2,104 deaths in the Philippines from Covid-19, according to a tally by Johns Hopkins University.",
        "predicted_topic": "business"
    },
    {
        "title": "US Treasury should get cut of TikTok deal - Trump",
        "url": "http://www.bbc.co.uk/news/business-53633315",
        "image": "https://ichef.bbci.co.uk/news/1024/branded_news/118DA/production/_113789817_tv062767125.jpg",
        "content": " Donald Trump says the government should get a cut from the sale of TikTok's US unit if an American firm buys it. The US president said he made a demand for a substantial portion of the purchase price in a phone call at the weekend with Microsoft's boss. He also warned he will ban the app, which is owned by China's ByteDance, on 15 September if there is no deal. ByteDance is under pressure to sell its US business after Mr Trump threatened a crackdown on Chinese tech companies. The Trump administration has accused TikTok and others of providing data to the Chinese government, which Beijing and TikTok deny. The United States should get a very large percentage of that price, because we're making it possible, Mr Trump said. It would come from the sale, which nobody else would be thinking about but me, but that's the way I think, and I think it's very fair, he added. The request for payment to the US Treasury further complicated negotiations as legal experts highlighted that such a demand to secure regulatory approval for a takeover deal would be highly unorthodox. Nicholas Klein, a lawyer at DLA Piper, said generally the government doesn't have the authority to take a cut of a private deal through the Committee on Foreign Investment in the United States, which is the inter-agency committee that reviews some foreign investments in the US. The state-run China Daily newspaper said on Tuesday that Beijing would not accept the theft of a Chinese technology company. It also warned in an editorial that China had plenty of ways to respond if the administration carries out its planned smash and grab. Charlotte Jee, a reporter at MIT Technology Review, a magazine owned by Massachusetts Institute of Technology, said Mr Trump's comments were pretty astonishing. Speaking to the BBC's Today programme, she said: I hate to say this but it is kind of almost Mafia-like behaviour - threatening a ban which pushes down the price then saying 'oh we should get a cut of that deal afterwards to say thank you for what we've done there'. It is extraordinary behaviour as well because last week we had lawmakers in the US trying to look at whether tech companies are too big and now we've got Trump trying to make one of them even bigger so it is a really, really bizarre situation to be in. Talks over a potential deal looked to have been derailed on Friday when Mr Trump said he opposed Microsoft buying TikTok's US business. While Mr Trump now giving his approval to a possible takeover is a major shift in the White House's position, the tight deadline for talks is another major hurdle for any potential deal. TikTok's US operations will close down on September 15 unless Microsoft or somebody else is able to buy it and work out a deal, an appropriate deal so the Treasury… of the United States gets a lot of money, he said. White House trade adviser Peter Navarro also suggested that Microsoft could shed its holdings in China if it buys TikTok's US business. So the question is, is Microsoft going to be compromised? Mr Navarro said in an interview with CNN. Maybe Microsoft could divest its Chinese holdings? Microsoft confirmed on Sunday in a blog post that it would continue discussions on a potential deal with TikTok after a call between its chief executive Satya Nadella and Mr Trump. The technology giant declined to comment further on the conversation between Mr Trump and Mr Nadella beyond the blog. At the weekend, US Secretary of State Mike Pompeo said President Trump would take action in the coming days against Chinese-owned software companies that he believed posed a national security risk. Mr Pompeo told Fox News that TikTok was among those feeding data directly to the Chinese Communist Party. However, he did not offer any evidence to back up his claim.",
        "predicted_topic": "business"
    },
    {
        "title": "Beach SOS saves sailors stranded on tiny island",
        "url": "http://www.bbc.co.uk/news/world-australia-53645758",
        "image": "https://ichef.bbci.co.uk/news/1024/branded_news/1368B/production/_113799497_sosjpg.jpg",
        "content": " Three Micronesian sailors stranded on a tiny, remote island in the western Pacific have been saved after rescuers spotted their SOS message on a beach. The men were found on Pikelot Island in Micronesia by Australian and US military aircraft on Sunday, the Australian Defence Force (ADF) said. They had been missing for three days after their 7m (23ft) skiff ran out of fuel and strayed far off course. All were found in a good condition with no major injuries, the ADF said. Authorities in Guam, a nearby US territory, initiated the search on Saturday, after the men failed to complete a 42km (26 miles) trip from Pulawat to Pulap atolls. Instead their vessel ended up at Pikelot Island, nearly 200km west of where they had set off. After their SOS was spotted from the air, an Australian helicopter landed on the tiny island and gave the men food and water. The helicopter came from the HMAS Canberra, which had been on its way to Hawaii for naval exercises when it was called to help in the search. The sailors were to be taken home by a Micronesian patrol vessel, Australian officials said. Micronesia, in the western Pacific, consists of some 600 tiny islands scattered over a vast ocean expanse.",
        "predicted_topic": "business"
    },
    {
        "title": "Hannity partners with RNC to fundraise for Trump's re-election by selling 'priority access' to his new book",
        "url": "http://us.cnn.com/2020/08/03/media/sean-hannity-book-rnc/index.html",
        "image": "https://cdn.cnn.com/cnnnext/dam/assets/200803101859-20200803-sean-hannity-book-super-tease.jpg",
        "content": " In fundraising emails the RNC sent on Sunday and Monday, the committee told supporters that those who donate $75 or more would get priority access to signed copies of Hannity's book Live Free or Die: America (and the World) on the Brink, which is set to be released Tuesday. As of Monday, Amazon listed it as the No. 2 selling book on the platform, followed by Mary Trump's Too Much and Never Enough at No. 3. Sunday's email included the language, Authorized by Trump Headquarters. We are only offering this exclusive opportunity to our TOP supporters of the Republican National Committee, like YOU, the email said. When you get your signed copy, in addition to benefiting the RNC, your contribution will also be helping us fight to re-elect the President and ALL Republicans this November. The arrangement helps the RNC raise money while Hannity sells copies of his book. That said, it's highly unusual for a major television news host to enter into an agreement with a political party for fundraising purposes. Adam Rothberg, a spokesperson for Simon & Schuster, said the publisher did not sell the books to the RNC and that it was not involved in any messaging by, or other activity of, the RNC relating to their purchases of the book or otherwise. Steve Guest, a spokesperson for the RNC, told CNN, The RNC regularly uses new books as part of our record-breaking fundraising efforts as we work to deliver victories across the country in November. Fox News has previously said that it does not allow its personalities to participate in campaign events with political candidates. But the network declined to comment and referred questions to Simon & Schuster when CNN Business pressed them about the two recent RNC emails. This isn't the first time that Hannity — who has a history of blatantly ignoring network rules and guidance — has partnered with a political party or candidate. In 2018, Hannity generated significant controversy when he campaigned on stage with Trump at a rally. Fox News staffers privately expressed disgust and a Fox News spokesperson reiterated at the time that the network does not condone any talent participating in campaign events. This was an unfortunate distraction and has been addressed, a Fox spokesperson said about Hannity's appearance at that rally in Missouri in 2018. Hannity also appeared in a 2016 campaign ad for Trump. At that time, a Fox News spokesperson said that the network had no knowledge that Hannity had participated in the advertisement, adding that he would not be doing anything along these lines for the remainder of the election.",
        "predicted_topic": "entertainment"
    },
    {
        "title": "Trump's TikTok threats may drive users to Facebook-owned Instagram. Is that the point?",
        "url": "https://www.nbcnews.com/think/opinion/trump-s-tiktok-threats-may-drive-users-facebook-owned-instagram-ncna1235712",
        "image": "https://media2.s-nbcnews.com/j/newscms/2019_38/3019791/190920-donald-trump-house-chamber-ac-439p_e0cecc62c3f985680f49d1c3a8024b72.nbcnews-fp-1200-630.jpg",
        "content": " Much of Donald Trump's presidency has seemingly been spent giving institutions a hard shove to see whether they'll bend or break. Now he's pushing on something that may be too big even for him: a politically active — or at least interested — loose coalition of teenagers, some of them on roller skates, who stan Jungkook. The president had threatened to ban the social media platform TikTok on Friday; on Monday, he said its U.S. operations would need to be sold to Microsoft (or another American company) within 45 days or the company would have to cease operating in the U.S. The ultimatum isn't completely without warning: Secretary of State Mike Pompeo told Fox News commentator (and enthusiastic Trump apologist) Laura Ingraham on July 6 that Americans should be cautious using the service because of the possibility it might put their personal information in the hands of the Chinese Communist Party. Persistent suspicion about foreign surveillance has dogged the app since its inception. TikTok is the international version of an app by parent company ByteDance; TikTok is banned in China, so ByteDance operates an identical app there called Douyin, which presumably stores its data in the country. The data of the company's 800 million or so international users, ByteDance says, are stored in the U.S. and Singapore, outside the purview of the Chinese government. This site is protected by recaptcha Privacy Policy | Terms of Service Still, there are a few reasons Trump might want TikTok banned, beyond a sudden and unprecedented concern for the data security of his fellow Americans. (Recall that, as a candidate, he actively — he says jokingly — encouraged hackers to intercept the communications of his opponent, praised WikiLeaks for publishing them, used the services of the data-mining company Cambridge Analytica, which trafficked in Americans' ill-gotten user data, and rejected U.S. intelligence reports that Russians interfered in the U.S. elections.) The first is spite: When Trump held his apparently lethal mid-pandemic rally in Tulsa, Oklahoma, on June 20, the whole internet made fun of him for his lousy attendance figures, especially because Trump underboss Brad Parscale had bragged that the campaign had received more than a million RSVPs (the arena seats 19,000 people; 6,200 attended). Trump hasn't forgotten or forgiven anyone involved in the fiasco: He demoted Parscale on July 15. But Parscale's overconfidence may have been encouraged by power users on TikTok, especially K-pop lovers, who said they flooded the campaign with ticket requests to inflate expectations and depress attendance. Trump is unpopular on the service, where his misfortunes are myriad: He recently and tragically failed a vibe check, a comedian who lip-syncs his speeches on it has rocketed to off-platform fame; and presidential counselor Kellyanne Conway's daughter has made headlines for mocking him on it. It would certainly be in keeping with Trump's character to try to take the service away from his detractors. But why would Trump want the company sold to Microsoft? It's one of a few companies the president has bear-hugged recently: A Pentagon contract for the JEDI war cloud software went to the company, despite protestations and then a lawsuit from Amazon, which called the bidding process anti-competitive. And Trump has said that part of the sale price should go to the Treasury; given how all of Trump's in-office dealings — up to and including stimulus payments to businesses endangered by the pandemic — seem to line his own pockets, it's reasonable to suspect that any money headed to the Treasury would be expected to make some expensive stops on the way there. Banning the app — or sparking a radically different version of it that users don't like as much — would also help the love of Donald Trump's life: Donald Trump. As news of his threat spread across the app, some of its hundreds of millions of users have set about packing their metaphorical bags for another service. Many TikTokers use the app as a source of income, receiving sponsorships and other forms of monetization. To keep their livelihoods, many now end their videos with their Instagram handles, encouraging users to follow them if and when they have to migrate to the Facebook-owned picture and video platform, which historically has been friendly to brands and influencers. And Facebook, of course, has a long history of cooperation with Trump. The company has been under constant scrutiny after foreign intelligence services misused it during the 2016 election, and it has responded to the scrutiny primarily by currying favor with whoever has the most power — specifically the administration of the president it helped to elect. But Instagram has been far less controversial, in part because its structure and lack of transparency make it harder for researchers to examine for viral disinformation, incitement to violence and conspiracy theories. But those problems are assuredly there, too: The anti-vaxxer movement has long had a foothold on Instagram, and the service is now (since it has been limited on other social media sites, like Twitter) a primary vector for QAnon conspiracy theorists, who may be responsible for at least one murder. QAnoners are also unwavering in their love for the president — and lately, he's made it very clear that he loves them right back. So if the big TikTok accounts migrate to Instagram, it would boost a platform that has gone all in on Trump without having gone all in on cleaning out the worst of the internet. And roller skates or no, the more people who use a platform Trump is getting his claws into, the better it is for Trump.",
        "predicted_topic": "entertainment"
    }
]