[
    {
        "title": "Kanye West's 2020 apology, Kim Kardashian's plea and a harsh truth about mental health",
        "url": "https://www.nbcnews.com/think/opinion/kanye-west-s-2020-apology-kim-kardashian-s-plea-harsh-ncna1235394",
        "image": "https://media1.s-nbcnews.com/j/newscms/2020_31/3400990/200730-kanye-west-2x1-al-1446_7b410e1403eec58def4198f36243fc9d.nbcnews-fp-1200-630.jpg",
        "content": " Iconic rapper Kanye West, who was diagnosed with bipolar disorder in 2017, shocked, disappointed and enraged many when he expressed his support for President Donald Trump in 2018. Such pronouncements marked the beginning of what would become a somewhat erratic few years for the musician, culminating recently in what is almost assuredly a doomed presidential bid. We must now realize the promise of America by trusting God, unifying our vision and building our future. I am running for president of the United States 🇺🇸! #2020VISION Throughout his time dabbling in conservative politics, West has made a series of confusing and often offensive statements — recently claiming that venerated freedom fighter Harriet Tubman, a Black woman, didn't really free the slaves, for example — amid what appear to be severe bipolar manic episodes. The star has since apologized to wife Kim Kardashian West, saying To Kim, I want to say I know I hurt you. Please forgive me. Thank you for always being there for me.” Kim Kardashian has also asked for compassion for her husband, noting that those who are close with Kanye know his heart and understand his words sometimes do not align with his intentions. But compassion hasn't been the default response. Kanye West has been heavily mocked and criticized — one person even admitted that she went to one of his campaign rallies only to check out the circus — with little understanding of how much bipolar disorder affects your life. (Consider, for example, that the rate of suicide for people with mostly undiagnosed bipolar disorder is 10 to 30 times higher than the rate for the general population.) Much has been done in recent years to destigmatize mental illness. But for people who experience anything beyond mild to moderate anxiety, depression or burnout, the stigma seems to remain just as potent. When I see the world relentlessly make ableist statements about West, I am reminded once more how it is both confused and often disgusted by people with severe mental illness like bipolar disorder — which I was diagnosed with seven years ago — as well as people with schizophrenia, obsessive compulsive disorder, dissociative identity disorder, complex post-traumatic disorder and more. As a society, we've encouraged people to be open about their mental health struggles, especially after difficult life events like the loss of loved ones, career instability or relationship problems. We've encouraged people to take time off for self-care. This is an important cultural shift, especially in a society that often sees such struggles as signs of weakness. This site is protected by recaptcha Privacy Policy | Terms of Service However, we haven't yet begun to discuss how to support those who are dealing with hallucinations, who experience different personality states or who experience mania or suicidal ideation. It's important to stress that although West may be experiencing bipolar symptoms, he is still accountable. His anti-Black, misogynist commentary is harmful, and he should respond to those criticisms when he is able to. But hyperfocusing on him and demanding a mea culpa while he's in crisis is harmful. So is dismissing him as a mere bigot or a manipulative person exaggerating his symptoms. Britney Spears' struggle with mental health is well documented. But while her illness was initially mocked, it now is often framed sympathetically, likely because it presents as innocuous and nonthreatening. This is often not the case for Black people with severe mental illnesses, who experience more stigma and violence because of how they exist at the intersection of racial marginalization and severe mental illness. Whether we are making offensive statements or not, we are inherently seen as dangerous by many. Britney Spears' struggle with mental health is well documented. But while her illness was initially mocked, it now is often framed sympathetically. This perception of danger often ends in tragedy. Pamela Turner, a Black woman with schizophrenia, was shot and killed by a Texas cop who knew of her condition last year. Before she was killed, Turner begged for her life, telling the officer that she was pregnant, which an autopsy revealed she wasn't. Despite the horrifying ableism, racism and misogyny that Turner faced that night, the streets didn't burn for her. Her story didn't ignite a movement. West is obviously more privileged than most severely mentally ill people like Turner, some of whom experience violence or homelessness because of a lack of resources. But his privilege is exactly why it's important to speak about him with intention. He is arguably the most visible person with a bipolar diagnosis in the world, and what society says about him has the potential to further the stigma against all people with bipolar or other severe mental illness. During a conversation with David Letterman in 2018, the rapper addressed this issue directly. Bipolar disorder is a health issue that has a strong stigma on it, and people are allowed to say anything about it and discriminate in any way, West told Letterman. This is like a sprained brain, like having a sprained ankle. And if someone has a sprained ankle, you're not going to push on him more. In his own words, during a more stable moment, West told us all exactly why it's so dangerous for us to heavily and publicly criticize severely mentally ill people when they are in crisis. We're pushing on them more. So much of the stigma against those with severe mental illness stems from a lack of education, which is caused by our unwillingness to acknowledge the more painful, confusing parts of mental illness. The public simply doesn't know enough about how these conditions often cause hallucinations, mania, suicide attempts, delusions and incoherent and rapid speech. As a result, people don't see these behaviors just as socially unacceptable, but sometimes as dangerous or even immoral. And when we are introduced to these conditions and behaviors, it's often through the extremely unforgiving and fetishizing filter of fame and media. Think of the sensationalized way Spears' mental health crisis was initially covered in 2007 and 2008. Pop culture doesn't help. In movies, people with severe mental illnesses are treated as a horror trope. The murderous Norman Bates from Psycho (1960) is a sensationalized portrayal of antisocial personality disorder — more derogatory terms for the condition are psychopath or sociopath — and dissociative identity disorder. In Split (2016), the similarly terrifying main character, James McAvoy, has 23 different personality states. In Showtime's TV series Shameless (2011-present), a bipolar woman (Monica Gallagher) is portrayed as an irredeemably bad mother. Meanwhile, her husband, Frank, is shown far more care and forgiveness, even though he puts his children through infinitely more danger. The further back you go, the worse the depictions get. In the lauded, Oscar-winning Girl, Interrupted (1999), Winona Ryder's character is flat-out told that she is making herself crazy, furthering the gendered stigma that people with borderline personality disorder are hysterical, intentionally manipulative and entitled. When we insist that offensive behavior like West's has nothing to do with mental illness, we further push some people with Cluster B illnesses to the margins. When people are introduced to severe mental illness through such public, sensationalized and ableist ways, it's no wonder the reaction is so negative. And when we insist that offensive behavior like West's has nothing to do with mental illness, we further push some people with Cluster B illnesses to the margins. Those conditions, like narcissistic personality disorder and antisocial personality disorder, can include symptoms like manipulation, trouble discerning from right and wrong or problems feeling empathy. However, sometimes even other severely mentally ill people or mental health advocates may not feel comfortable acknowledging the realities of the harm these illnesses can cause. Part of this might be because of the fear we've inherited from portrayals of these disorders, which often include extremes like murder. It can feel as though, by discussing these disorders honestly, we are ourselves perpetuating the stigma. But in truth, it is by erasing these disorders that we are perpetuating the stigma. The point is that mental illness is neither something to be pitied nor something to inherently fear. We have to have compassion for those who are obviously struggling and encourage them to seek help. But we also don't have to excuse their behavior or ignore it — although ignoring it is sometimes the best thing to do, especially in the case of West. West's struggles have the potential to ignite deeply important conversations about severe mental health conditions and how to support those with them. As West himself said, pushing on severely mentally ill people only makes the situation worse.",
        "predicted_topic": "entertainment"
    },
    {
        "title": "Coronavirus safety plans already put to the test as some communities start the school year",
        "url": "http://us.cnn.com/2020/08/01/health/us-coronavirus-saturday/index.html",
        "image": "https://cdn.cnn.com/cnnnext/dam/assets/200801014827-school-lockers-0420-super-tease.jpg",
        "content": " Don't expect a normal school year, New Jersey Gov. Phil Murphy said Friday when talking about the possibility of changing the state's school plans in light of rising cases. Normalcy is not in our grasp right now. Let's all accept that. School districts have been debating how to accommodate educational needs and safety in a nation with more than 4.5 million coronavirus cases and 153,314 deaths, according to data from Johns Hopkins University. As the new school year began for some schools this week, 60 of the 101 largest US school districts had plans to start the year entirely online, while others were offering in-person classes part or full time. Top infectious disease expert Dr. Anthony Fauci has warned that children going back to school will be part of the experiment of understanding the virus. An Indiana school district was put to the test on the first day Thursday when the Hancock County Health Department told a junior high school that a student who had attended part of the day tested positive, Superintendent Dr. Harold Olin said in his letter to parents. The school enacted its Positive COVID-19 Test Protocol, isolated the student and professionally disinfected the school, Olin said. It was very evident today that nearly all of our families and students were prepared to properly follow the safety protocols we have established, Olin wrote to parents. Adhering to these protocols is essential for maintaining a safe environment for all students and staff. Infections in younger people While early data suggested that older Americans were most at risk for the disease, concern for teens and young adults has grown as they have gathered in reopened public spaces and some prepare to return to school. The California Department of Public Health confirmed the first coronavirus-related death of a teenager in the state on Friday. The department did not provide information on the patient except to say that the teenager did have underlying health conditions. Our hearts go out to the family and loved ones of this young person whose death is a tragic and powerful reminder of how serious Covid-19 can be, said Dr. Sonia Angell, State Public Health Officer and Director of the CDPH. In Connecticut Gov. Ned Lamont said Thursday that he and the state's public health commissioner are concerned about clusters among teens and young adults. The coronavirus infection numbers among 10 to 19-year-olds had doubled recently, Lamont said, though he did not provide specific numbers. This is not a time to relax our basic practices to slow down the spread of the virus. This is a time for remaining vigilant, Lamont said in a release. Local leaders tackle the impacts of a resurgence Other state and local leaders are enacting measures to slow down the virus as cases continue to spike. The city of Anchorage, Alaska, rolled back parts of its economic reopening for at least the next four weeks, limiting outdoor gatherings to 50 people; prohibiting bars, nightclubs and restaurants from indoor service; and extending the city's indoor mask mandate to outdoor events where social distancing isn't possible, Mayor Ethan Berkowitz said at a Friday news conference. We know there is a Covid storm coming, Berkowitz said. This is our time to batten down. A surge has already hit in Alabama, overwhelming the state's testing abilities, the Alabama Department of Public Health said Friday, asking doctors to focus testing on the most vulnerable populations. Alabama is among the at least 39 states, Washington, DC, and Puerto Rico to have some type of mask requirement in place. Georgia Gov. Brian Kemp, who sued Atlanta Mayor Keisha Lance Bottoms over her mask requirement for the city, has extended existing Covid-19 safety measures through September 10, he announced in a news release on Friday. While there is still no mask mandate, the order continues to ban gatherings of more than 50 people unless there is six feet between each person and outlines mandatory criteria for businesses. Racing to develop tests Health experts are expediting coronavirus tests to help officials and the public combat the virus. The US Food and Drug Administration issued emergency use authorizations Friday for two tests that can tell not only whether someone has antibodies to coronavirus but can give some idea of how much antibody is present. Evaluating antibodies is important as researchers investigate if people who have been infected develop immunity, a question Dr. Tim Stenzel, the director of the Office of In Vitro Diagnostics and Radiological Health in the FDA's Center for Devices and Radiological Health, said has yet to be answered. Patients should not interpret results as telling them they are immune, or have any level of immunity, from the virus, he said.",
        "predicted_topic": "politics"
    },
    {
        "title": "Mexico's virus death toll world's third highest",
        "url": "http://www.bbc.co.uk/news/world-latin-america-53618808",
        "image": "https://ichef.bbci.co.uk/news/1024/branded_news/347D/production/_113773431_hi062739832.jpg",
        "content": " Mexico has become the country with the third highest death toll with coronavirus, with only the US and Brazil recording greater numbers. It has now suffered at least 46,688 deaths during the pandemic, with a total of 424,637 infections. Previously the United Kingdom had the third highest toll, and registered 46,204 deaths as of Friday. The World Health Organization (WHO) has warned the effects of the pandemic will be felt for decades to come. In Mexico, local authorities have previously said they believe the real number of infections is likely to be significantly higher than those reported. President Andrés Manuel López Obrador is eager to restart the country's flagging economy. His government announced a phased plan to lift restrictions in May. In Mexico City, the capital, hundreds of thousands of factory workers returned to their jobs in mid-June. Some non-essential businesses were then allowed to reopen at the start of July in the city, the epicentre of the country's epidemic. But critics say Mr Obrador was slow to impose lockdown measures and has lifted them too quickly. Most of the Mexican economy stopped on 23 March but some industries that were declared key to the functioning of the nation and were exempt from the restrictions. On Friday ten state governors chastised the government's handling of the outbreak and called for the resignation of Assistant Health Secretary Hugo López-Gatell - an epidemiologist and Mexico's coronavirus tsar. More than 17.5 million coronavirus cases have been reported worldwide, along with nearly 679,000 deaths, according to a tally by Johns Hopkins University. The US has recorded at least 153,415 deaths and Brazil 92,475. Some countries have tried to emerge from lockdown but in many, cases are rising again, reports the BBC's Geneva correspondent, Imogen Foulkes. Some, like Spain and the UK, are partially reintroducing restrictions or delaying plans for their easing. More measures were expected to be relaxed in England this weekend but Prime Minister Boris Johnson said on Friday that this would be delayed for at least two weeks. With cases continuing to rise around the world, WHO head Dr Tedros Ghebreyesus called the pandemic a once-in-a-century health crisis, the effects of which will be felt for decades to come. Although vaccine development is happening at record speed, we must learn to live with this virus, and we must fight it with the tools we have, he said on Friday.",
        "predicted_topic": "business"
    },
    {
        "title": "Trump says he will ban TikTok in the US",
        "url": "http://www.bbc.co.uk/news/world-us-canada-53619287",
        "image": "https://ichef.bbci.co.uk/news/1024/branded_news/5237/production/_113774012_hi062736473.jpg",
        "content": " President Donald Trump has announced he is banning the Chinese-owned video-sharing app TikTok in the US. He told reporters he could sign an executive order as early as Saturday. US security officials have expressed concern that the app, owned by Chinese firm ByteDance, could be used to collect the personal data of Americans. TikTok has denied accusations that it is controlled by or shares data with the Chinese government. The fast-growing app has up to 80 million active monthly users in America and the ban would be a major blow for ByteDance. As far as TikTok is concerned, we're banning them from the United States, Mr Trump told reporters aboard Air Force One. It was not immediately clear what authority Mr Trump has to ban TikTok, how that ban would be enforced and what legal challenges it would face. Microsoft has reportedly been in talks to buy the app from ByteDance, but Mr Trump appeared to cast doubt that such a deal would be allowed to go through. If the deal went ahead reports say it would involve ByteDance shedding TikTok's US operations. A TikTok spokesperson declined to comment on Mr Trump's mooted ban, but told US media outlets the company was confident in the long-term success of TikTok in the US. The move to ban TikTok comes at a time of heightened tensions between the Trump administration and the Chinese government over a number of issues, including trade disputes and Beijing's handling of the coronavirus outbreak. The platform has exploded in popularity in recent years, mostly with people under 20. They use the app to share 15-second videos that often involve lip-synching to songs, comedy routines and unusual editing tricks. These videos are then made available to both followers and strangers. By default, all accounts are public, although users can restrict uploads to an approved list of contacts. TikTok also allows private messages to be sent but this facility is limited to friends. The app is reported to have around 800 million active monthly users, most of whom are in the US and India. India has already blocked TikTok as well as other Chinese apps. Australia, which has already banned Huawei and telecom equipment-maker ZTE, is also considering banning TikTok. US officials and politicians have raised concerns data collected by ByteDance via TikTok may end up being passed to the Chinese government. TikTok operates a similar but separate version of the app in China, known as Douyin. It says all US user data is stored in the US, with a backup in Singapore. This week, TikTok told users and regulators it would observe a high level of transparency, including allowing reviews of its algorithms. We are not political, we do not accept political advertising and have no agenda - our only objective is to remain a vibrant, dynamic platform for everyone to enjoy, the CEO of TikTok, Kevin Mayer, said in a post this week. TikTok has become the latest target, but we are not the enemy.",
        "predicted_topic": "business"
    },
    {
        "title": "Hurricane warning now in place for part of Florida as Isaias approaches",
        "url": "https://www.nbcnews.com/news/weather/hurricane-warning-now-place-part-florida-isaias-approaches-n1235557",
        "image": "https://media1.s-nbcnews.com/j/newscms/2020_31/3401440/200731-florida-hurricane-prep-ac-1009p_69b2c7596bd276e745e94cabe30e0663.nbcnews-fp-1200-630.jpg",
        "content": " A hurricane warning was issued for part of Florida's eastern coast on Friday as Hurricane Isaias approached the state after soaking parts of the Bahamas, forecasters said. Isaias, which had maximum sustained winds of 80 mph, was expected to be near the east coast of the Florida peninsula starting Saturday afternoon through Sunday. By late Friday, a hurricane warning had been issued for the Florida coast from Boca Raton, which is around 40 miles north of Miami Beach, to the county line between Volusia and Brevard counties, the National Hurricane Center said. That stretch of the coast is around 160 miles. At sustained winds of 80 mph, that would make Isaias a Category 1 hurricane on the Saffir-Simpson Hurricane Wind Scale. Palm Beach County, which is in the warning area, said it was opening four shelters and one for animals Saturday morning. The shelters are for residents of mobile or manufactured homes and other housing deemed substandard. Florida Gov. Ron DeSantis assured residents Friday that the state of Florida is fully prepared for this, and any future storm during this hurricane season. He has urged residents to have a plan and to have seven days' worth of food, water and medicine. This site is protected by recaptcha Privacy Policy | Terms of Service The state is also dealing with the coronavirus pandemic, and DeSantis said emergency officials have stockpiled personal protective equipment for the hurricane season. It is hard to imagine that we are talking about a storm event on July 31st, Howard Tipton, administrator for St. Lucie County, which is north of Palm Beach County, said at a news conference. It's just kind of been the way 2020's going so far, but we roll with it, right? We don't get to determine the cards that we're dealt. Miami-Dade County ordered parks, beaches, marinas and golf courses closed through at least Saturday. The Port of Miami said it would close at midnight. Florida Power & Light Company said it activated its emergency response plan and recruited around 2,000 people from 10 states to help restore power. The utility expects a large part of its coverage area to feel the storm's effects. The Miami area was under a tropical storm warning, and the National Weather Service said to prepare for 25-35 mph winds, which could damage roofs and topple trees, but no storm surge inundation was expected there. County Mayor Carlos Giménez said Friday morning that it had 20 evacuation centers on standby. It's really too early to tell yet, so we are closely monitoring the situation, he said. Authorities in North Carolina ordered the evacuation of Oracoke Island, which was slammed by last year’s Hurricane Dorian, starting Saturday evening. Bahamas evacuated people in Abaco who have been living in temporary structures since Dorian and people on the eastern end of Grand Bahama. The hurricane knocked shingles off roofs and tumbled trees as it carved its way through the archipelago. In Florida, tropical storm warnings and watches covered other parts the state near the coast, including in Orlando and the Fort Lauderdale area where there was also a hurricane watch. Tropical storm winds are expected to arrive in the Hurricane Warning area in Florida Saturday afternoon and evening. Preparations to protect live and property in those areas should be rushed to completion #Isaias pic.twitter.com/0Xe1PUGKtK In the warning area in Florida, hurricane conditions are expected to arrive late Saturday and Saturday night, the hurricane center said. It will be preceded by tropical storm-force winds, and preparations to protect life and property should be rushed to completion, the center said in an advisory. The hurricane center said late Friday in a discussion statement that westerly shear was limiting the intensification of the storm, but that some strengthening was still possible Saturday. Even if it does not make landfall, the storm is relatively large and its effects could extend beyond the hurricane's center. A Storm Surge Watch has been issued from Jupiter Inlet to Ponte Vedre Beach, Florida, where there is the possibility of life-threatening inundation from storm surge. Residents in these areas should follow the advice given by local emergency officials. pic.twitter.com/4Rfdlp84QK On Thursday, while still a tropical storm, Isaias toppled trees, destroyed crops and caused widespread flooding and small landslides in the Dominican Republic and Puerto Rico, where hundreds of thousands of people were left without power and water. Officials reported that a man died in the Dominican Republic when he was electrocuted by a fallen electrical cable. More than 5,000 people were evacuated, and more than 130 communities remained cut off by floodwaters.",
        "predicted_topic": "business"
    }
]