[
    {
        "title": "Bollywood star Sushant Singh Rajput dies at 34",
        "url": "http://www.bbc.co.uk/news/world-asia-india-53041878",
        "image": "https://ichef.bbci.co.uk/news/1024/branded_news/15FD/production/_112892650_mediaitem112892649.jpg",
        "content": " One of the biggest stars in Bollywood, Sushant Singh Rajput, has been found dead in his apartment in Mumbai. The 34-year-old is believed to have taken his own life, Mumbai police said. Popular for his acting in both TV and film, Rajput is perhaps best known for MS Dhoni: The Untold Story, where he played the legendary cricketer. Many have been paying tributes to Rajput, including Indian Prime Minister Narendra Modi, who called him \"a bright young actor gone too soon\". Rajput's death comes just days after that of his former manager. Sushant Singh Rajput...a bright young actor gone too soon. He excelled on TV and in films. His rise in the world of entertainment inspired many and he leaves behind several memorable performances. Shocked by his passing away. My thoughts are with his family and fans. Om Shanti. End of Twitter post  by @narendramodi The actor's last film was Chhichhore, which was released last year. In his last post to his 10.2 million Instagram followers on 3 June, Rajput posted a picture of late mother, who died in 2002, when he was a teenager, according to India's PTI news agency.  He wrote: \"Blurred past evaporating from teardrops\".  Blurred past evaporating from teardrops Unending dreams carving an arc of smile And a fleeting life, negotiating between the two... #माँ ❤️ A post shared by  Sushant Singh Rajput (@sushantsinghrajput) on Jun 3, 2020 at 5:43am PDT End of Instagram post  by sushantsinghrajput His former manager, Disha Salian, 28, died earlier this week after falling from the 14th floor of a building in Mumbai. In a Instagram story after her death, Rajput wrote: \"It's such devastating news. My deepest condolences to Disha's family and friends. May your soul rest in peace.\" His death will be mourned by Bollywood fans across the globe still reeling from the deaths of legendary actors Rishi Kapoor and Irrfan Khan within days of each other in April.  If you or someone you know needs support for issues about emotional distress, these organisations may be able to help."
    }
][
    {
        "title": "India to use train carriages as coronavirus wards",
        "url": "http://www.bbc.co.uk/news/world-asia-india-53039868",
        "image": "https://ichef.bbci.co.uk/news/1024/branded_news/15A8F/production/_112891788_mediaitem112891787.jpg",
        "content": " India is to convert another 500 railway carriages to create 8,000 more beds for coronavirus patients in Delhi, amid a surge in infections. Home Minister Amit Shah announced a package of new emergency measures for the capital, including a rapid increase in testing for Covid-19. Nursing homes will also be requisitioned. He met Delhi's Chief Minister Arvind Kejriwal to address the crisis.  India's daily number of confirmed new cases has reached almost 12,000. The total number of 320,922 officially confirmed cases puts India fourth in the world - after the US, Brazil and Russia - in the pandemic.  The death toll in India stands at 9,195, according to data compiled by Johns Hopkins University from official sources.  The Hindustan Times reports that Delhi is the third worst-hit state in India after Maharashtra and Tamil Nadu.  It reports that Delhi's bed capacity across private and government hospitals for Covid-19 patients stands at 9,698, of which 4,248 beds are vacant. Mr Kejriwal's government plans to use 40 hotels and 77 banquet halls as makeshift hospitals.  India began converting railway carriages into quarantine or isolation wards in April, when large parts of the railway network were suspended owing to the pandemic.  Last month the national government announced plans to end a national lockdown that began on 25 March.  Road and plane traffic increased as restrictions started to ease, and many businesses and workplaces reopened. Markets are crowded again. The lockdown has imposed huge economic costs on India, throwing millions of people out of work, especially migrant workers in precarious, meagrely-paid jobs. Food supply chains were also put at risk."
    }
][
    {
        "title": "CNN crew harassed and camera broken during protest - CNN Video",
        "url": "http://us.cnn.com/videos/us/2020/06/14/atlanta-wendys-shooting-rayshard-brooks-protest-cnn-crew-chen-sot-vpx.cnn",
        "image": "https://cdn.cnn.com/cnnnext/dam/assets/200613222018-wendys-atlanta-brooks-protest-saturday-june-13-super-tease.jpg",
        "content": ""
    }
][
    {
        "title": "Why military leaders rejected Trump's view of racial conflict",
        "url": "http://us.cnn.com/2020/06/14/politics/trump-military-racism-analysis/index.html",
        "image": "https://cdn.cnn.com/cnnnext/dam/assets/200612152027-mattis-trump-esper-split-super-tease.jpg",
        "content": " But it isn't. The split quickly comes into focus when you consider its underpinning in radically divergent views about race in a diversifying America. Today's military leaders not only welcome racial diversity, they depend on it for America's national security. For the 21st century GOP President Donald Trump leads, diversity represents a mortal threat. The repudiation Trump suffered, from the men in uniform he has surrounded himself with to convey an image of toughness, was initially cast in the language of civilian-military relations.  Defense Secretary Mark Esper spurned Trump's idea of deploying active-duty troops against Americans protesting police brutality against blacks. Former Defense Secretary Jim Mattis added his indictment of the President's preference for division over unity, casting it as fundamentally un-American. Retired Marine Gen. John Kelly, once Trump's White House chief of staff, joined other prominent military figures in echoing that scathing assessment.  Yet their words reflected much more than disagreement over the applicability of the 1807 Insurrection Act, which Trump has threatened to invoke as cover for bringing in the military to quell civilian unrest. The racial conflict Trump embraces is something the armed forces, as one of the most successfully-integrated institutions in American history, simply cannot abide.  From Truman to Powell President Harry Truman ended segregation in the armed forces by executive order in 1948. Within four decades, the military sociologist Charles Moskos concluded, \"Blacks occupy more management positions in the military than they do in business, education, government, or any other significant sector of American society.\"  Colin Powell became the first black chairman of the Joint Chiefs of Staff in 1989, two decades before Barack Obama became the first black President. While African Americans are about 13% of the US population, they represent 11% of Army officers and 24% of enlisted Army soldiers.   \"We can't exist without some sense of racial fairness,\" observes retired Army Gen. Barry McCaffrey.   Air Force Gen. Charles Q. Brown Jr., who was confirmed on Tuesday as the first black service chief in the US military, underscored that point by reflecting publicly on protests over the death of George Floyd at the hands of Minneapolis police. \"I'm thinking about how full I am with emotion not just for George Floyd, but the many African-Americans who have suffered the same fate,\" Brown said in an online video. \"I'm thinking about a history of racial issues and my own experiences that didn't always sing of liberty and equality.\" The GOP and black voters The civil rights movement took the Republican Party in the opposite direction. After Democratic President Lyndon Johnson signed the Civil Rights Act in 1964, over the opposition of Republican opponent Barry Goldwater, white conservatives, in the South and elsewhere, exited the Democratic Party in droves. They expanded and transformed the GOP, helping create a presidential majority that won five of six White House contests from 1968 to 1988. But at the same time, black support for the GOP plummeted. Now demographic change -- shrinking the white share of the electorate from nine in 10 to seven in 10 and dropping -- has given Democrats the upper hand. Every uptick in non-white voting erodes Republican power, leading the GOP to fight measures that make casting ballots easier. Blue-collar whites, who rallied behind Trump's polarizing 2016 appeals, dominate the GOP rank-and-file. Pew Research Center polling in 2019 showed broad Republican alarm about false claims of racism, belief that America has done enough to provide equal rights, and concern that whites are as likely as blacks to face \"a lot\" of discrimination.  Doubts about systemic racism Little wonder that top Trump advisers insist systemic racism doesn't exist. Attorney General William Barr, having seen the proportion of white Christians in America drop by half to around 40% in his lifetime, sees a different systemic threat: from \"militant secularists\" and progressives seeking \"organized destruction\" of religion and traditional values.  It was Barr who directed federal officers with tear gas and rubber bullets to push protestors off a street near the White House on June 1. Trump then walked across that street to a church, where he held a Bible aloft for photographs flanked by the Attorney General and other white advisers. That government-initiated violence proved the tipping point for Mattis and other military leaders. Mark Milley, the current chairman of the Joint Chiefs of Staff, apologized late last week for accompanying Trump on that walk and thereby suggesting his involvement in \"domestic politics.\"  The turn to the issue of Confederate symbols took the debate into explicitly racial territory. The Navy joined the Marines in banning Confederate emblems on their installations, and retired Army Gen. David Petraeus aligned himself with protesters by proposing to rename military bases that honor Confederate generals.  Pentagon leaders, and even Republicans in Congress, signaled openness to that debate. Trump brusquely cut it off in the name of \"a \"Great American Heritage.\"  At one incongruous moment, the two sides converged. Trump's nomination of Brown to become the first black Air Force chief of staff -- announced by Esper in March -- finally reached the Senate floor. Republican and Democratic senators confirmed him unanimously.  \"A Patriot and a Great Leader!\" Trump tweeted."
    }
][
    {
        "title": "Polish leader likens LGBT 'ideology' to communism",
        "url": "http://www.bbc.co.uk/news/world-europe-53039864",
        "image": "https://ichef.bbci.co.uk/news/1024/branded_news/491F/production/_112891781_mediaitem112891779.jpg",
        "content": " Polish President Andrzej Duda has called the promotion of LGBT rights an \"ideology\" more destructive than communism, in a campaign speech. He is an ally of the ruling nationalist Law and Justice Party (PiS), and is seeking re-election on 28 June. He said his parents' generation had struggled against communist ideology for 40 years and \"they didn't fight for this so that a new ideology would appear that is even more destructive\". Critics say PiS has an anti-gay agenda. The LGBT rights group ILGA-Europe says Poland is the worst-performing country in the EU in terms of LGBT rights, in an index published last month. PiS won a majority in parliament with a conservative-nationalist agenda strong on Catholic values, including support for traditional families and opposition to gay marriage.  Speaking to supporters in Brzeg, southwestern Poland, Mr Duda said \"parents are responsible for the sexual education of their children,\" and \"it is not possible for any institutions to interfere in the way parents raise their children\". On 10 June he signed a \"Family Charter\" of election proposals, including pledges to prevent gay couples from marrying or adopting children and to ban teaching about LGBT issues in schools.  Putting LGBT rights activism in the same category as communism can be seen as inflammatory in Poland, where the anti-communist Solidarity movement led the struggle for democracy in the 1980s. Many Poles agree with the PiS message that communism was a foreign ideology imposed on Poles by the Soviet Union.  PiS has clashed with the EU over judicial reforms which, according to PiS, are necessary to eliminate vestiges of communist-era corruption. Critics in the EU say PiS is politicising the judiciary and violating EU principles. The European Commission has written to the heads of five Polish provinces expressing concern about resolutions in which they declare themselves \"free from LGBT ideology\". The EU's executive has reminded them of their duty to guarantee non-discrimination as a core EU value.  Opinion polls suggest that Mr Duda is favourite to win the 28 June election, though his lead has shrunk amid the economic impact of the coronavirus crisis.  One of his chief rivals, liberal Warsaw Mayor Rafal Trzaskowski of the centre-right Civic Platform (PO) party, has been criticised by religious conservatives for allowing discussion of LGBT issues in Warsaw schools. The election is likely to go to a second-round runoff vote. In his speech in Brzeg, Mr Duda said \"this is not why my parents' generation for 40 years struggled to expel communist ideology from schools, so that it could not be foisted on children, could not brainwash and indoctrinate them... \"They did not fight so that we would now accept that another ideology, even more destructive to man, would come along, an ideology which under the clichés of respect and tolerance hides deep intolerance\".   Rival candidate Robert Biedron of the Left party - an LGBT rights activist - called Mr Duda's Family Charter \"a radical document which divides Polish society, introducing standards reminiscent of the most brutal... times of Polish and European history\". "
    }
]