[
    {
        "title": "Atlanta Mayor Keisha Lance Bottoms: Rayshard Brooks was a guy you were rooting for - CNN Video",
        "url": "http://us.cnn.com/videos/politics/2020/06/14/keisha-lance-bottoms-rayshard-brooks-video-mayors-racial-inequality-cnn-town-hall-sot-vpx.cnn",
        "image": "https://cdn.cnn.com/cnnnext/dam/assets/200614205841-keisha-lance-bottoms-mayors-town-hall-june-14-super-tease.jpg",
        "content": ""
    }
][
    {
        "title": "Philippine journalist Maria Ressa found guilty",
        "url": "http://www.bbc.co.uk/news/world-asia-53046052",
        "image": "https://ichef.bbci.co.uk/news/1024/branded_news/148B2/production/_111764148_breaking-promo.png",
        "content": " In a case seen as a test of the Philippines' media freedom, journalist Maria Ressa has been found guilty of cyber libel. She denied the charges, and claimed they were politically motivated. A former writer for her news site, Rappler, was also convicted. Both have been released on bail pending appeal, but could face six years in prison. Press freedom advocates say the trial is aimed at silencing critics of President Rodrigo Duterte. But the president and his supporters have accused her and her site of peddling fake news. In a country where journalists are under threat, Ms Ressa's case became symbolic and closely-followed - both domestically and internationally. A former CNN journalist, Ms Ressa founded Rappler in 2012. The news organisation has become a critic of the Duterte administration - and the its brutal war on drugs.  The case against her relates to an eight-year-old report on a businessman's alleged ties to a former judge. It comes under a controversial \"cyber-libel\" law, which came into force in September 2012, four months after the article in question was published. The judge on Monday said Rappler offered no proof to back up its allegations against the businessman. "
    }
][
    {
        "title": "The next Greatest Generation",
        "url": "http://us.cnn.com/2020/06/14/opinions/black-lives-matter-gen-z-greatest-generation-gergen-cohen/index.html",
        "image": "https://cdn.cnn.com/cnnnext/dam/assets/200613174138-ferguson-floyd-family-protest-super-tease.jpg",
        "content": "   On the opposite coast, Kerrigan Williams and Jacqueline LaBayne, ages 22 and 23, organized a sit-in at the US Capitol by mobilizing the followers of Freedom Fighters DC -- most of whom belong to their Generation Z age group. In Bend, Oregon, 21-year-old Adriana Aquarius organized a local protest in her hometown; in Olean, New York, it was 23-year-old Jamel Burney who took the lead; and in Nashville, Tennessee, six teenagers congregated over 20,000 people to call for an end to systemic racism. And it was a 17-year-old, Darnella Frazier, who filmed and published on social media a white Minneapolis police officer pressing his knee on the neck of George Floyd for nearly nine minutes.  We will never know exactly how many have taken to the streets in the past few weeks, protesting the death of Floyd and other African Americans due to police brutality. But we do know this: these protests show that a new generation of young leaders is springing up across the land. A recent survey by University of Maryland sociologist Dana Fisher and a team of researchers in New York, Washington, Los Angeles and London found that half of protesters surveyed were under the age of 30. They are black, brown and white. They are rising up in communities everywhere. They are non-violent, yet passionate. And they offer a glimpse of a much brighter future.   Their promise is something of a surprise. As commentators like Charlotte Alter have recognized, Millennials and Gen Z have endured a series of punishing, almost knock-out blows growing up. They have survived 9/11 and subsequent wars in Iraq and Afghanistan. Two sharp recessions have left them with the worst economic prospects in decades. Millions have shouldered the burden of ever-increasing college debt. Recently, the global pandemic has not only locked them down socially but left them with a prospect of returning to college life that will be unrecognizable. President John F. Kennedy long ago noted that \"life is unfair,\" but does that apply to entire generations?    To many, this succession of devastating events would prove discouraging and, indeed, these generations have struggled with mental health challenges at a distressing rate. But what we have been seeing is that many Millennials and Gen Zers are also resilient, persistent and fed up with the longstanding history of inequity in our society. They want to be part of a movement to make life fairer, starting with justice for black Americans.    Seven years ago, three young black women in their late 20s and early 30s -- Alicia Garza, Opal Tometi and Patrisse Khan-Cullors -- launched #BlackLivesMatter after the murder of a black teenager, Trayvon Martin. They organized more protests after the deaths of Michael Brown in Ferguson and Eric Garner in New York.  While #BlackLivesMatter gained significant traction surrounding isolated protests, it had trouble breaking into the mainstream.    Commentators on the right relentlessly attacked its supporters. In 2016, only 27% of Americans viewed Black Lives Matter favorably. But events of recent months, stretching from Covid-19 to the devastation of the economy and the killing of George Floyd, brought emotions to the boiling point. And #BlackLivesMatter became a galvanizing force. A Pew poll shows that public approval of the movement has shot up to 67%.  Generational activism now transcends racial groupings. Lara Putnam, a historian who studies grassroots organizing at the University of Pittsburgh, told Time that, \"communities of color are stepping forward in outrage and saying we can't let this keep happening. But also, there's a young generation of white people who see that vision and are being mobilized to no longer just treat this as somebody else's problem.\" Long-time observers can well remember how many white people were tentative about joining the civil rights protests of the 1960s. In recent days, however, Fisher's team of researchers found that 61% of protesters surveyed in New York City and 65% in Washington, DC, were white.   In Minneapolis, 18-year-old Ranay Barton reflected the change in attitude when she went downtown to a memorial for Floyd. \"The first thing that ran through my mind was to be mad at white people,\" she told The New York Times. \"When things like this happen, you tend to segregate yourself. But seeing all the support and solidarity calmed me down. All these people are different colors, from different places, coming together for a purpose. I feel like the world should be like that.\"   The activism of these younger generations stems, in part, from being more distraught about by our systematic inequities than their older counterparts. According to the Public Religion Research Institute (PRRI), almost two-thirds of young Americans say the police killings of African American men are part of a broader problem, compared with 43% of seniors. What is more, among white Americans alone, a Pew Research Center study found 51% of those between ages 18 and 29 believe we have not done enough to assure equal rights for black Americans; only 28% of whites ages between 50 and 64 would say the same. While there is much that is encouraging, the path ahead for the young, emerging leaders of today is likely to be long and torturous. Resistance won't disappear without a fight.  As the civil rights leaders of the 1960s and '70s discovered, the arc of history may bend toward justice -- but it usually needs lots of help.  This article was updated to include the results of a Pew poll on public approval of the Black Lives Matter movement. "
    }
][
    {
        "title": "Retailers get ready to reopen after three months",
        "url": "http://www.bbc.co.uk/news/business-53044826",
        "image": "https://ichef.bbci.co.uk/news/1024/branded_news/AAEF/production/_112895734_lock.jpg",
        "content": " Shops in England selling non-essential goods can reopen on Monday for the first time in almost three months. Retailers have had to introduce strict safety measures and the High Street experience will be very different. Amid fears about the health of the UK economy, getting a key part of the service sector running again is vital. But retail experts warned shops were unlikely to see any immediate relief. Boris Johnson has urged people to \"shop with confidence\". He said he was \"very optimistic\" about stores reopening - although acknowledged that retailers did not know whether there will be a \"huge wave of customers\" or a \"trickle\". The unlocking comes as face coverings become compulsory when travelling on public transport in England from Monday. Children under the age of 11 will be exempt, and the rules might be waived for people who have a legitimate health reason for not wearing one.  However, face coverings in shops will not be mandatory, with retailers hoping their introduction of an array of other safety measures will be sufficient.  Although food shops, pharmacies, banks and other essential retailers have stayed open, vast swathes of the High Street, from bookshops to clothes outlets, have been closed since 23 March. Retailers are required to introduce plastic screens at the tills and floor markings to keep shoppers two metres (6ft 5ins) apart - measures that are already a regular fixture in supermarkets.  Other measures will include pleas not to touch items unless customers intend to purchase them and decontaminating shopping baskets after each use. Retailers are promising there will be plenty of sanitiser on hand for customers. In most clothes shops, fitting rooms will be closed. Bookshops including Waterstones intend to put items in quarantine if browsed but not bought, while some jewellers are introducing ultraviolet boxes that can decontaminate items in minutes.  There is also government funding for councils to deploy staff on the High Street to provide help and advice for both shoppers and shops. Not all stores will throw open their doors immediately. John Lewis will reopen just two outlets on Monday - in Kingston upon Thames and Poole - as part of a phased approach, with 11 others to follow on Thursday. The number of customers entering stores will be regulated, but Andrew Murphy, executive director of operations, hopes it will mean a better atmosphere for shoppers. \"To be honest, I actually think it's going to be the relative calmness of the experience that will probably be the main thing that strikes people.\" But he did not expect a lifting of the measures any time soon. \"We expect this situation to last well into autumn and perhaps winter so we need to be thinking ahead for how things will work when the weather's not so great,\" he said.  Some other retailers selling products classed as essential - such as DIY, furniture and bicycles - have also been reopening. Furniture giant Ikea opened 19 of its stores across England and Northern Ireland recently, prompting long queues. Shoppers at Selfridges, which is reopening its London, Manchester and Birmingham branches, will have the chance to try before they buy, but any clothes will then be quarantined, while shoes and accessories will be cleaned with sanitising spray or steamed. Primark, which will open each of its 153 English stores, has pledged to ensure basket handles are cleaned after each use and that every second till will be closed to maintain social distancing for customers and employees. Many stores are encouraging customers to make purchases by contactless card payments, with limits increased to £45. Arcadia, which owns the likes of Topshop, Miss Selfridge and Dorothy Perkins, has said it will not accept cash. London's West End, which includes Oxford Street, is expecting about 80% fewer visitors when it reopens on Monday. Many retailers and analysts are watching closely to see if the surge in online shopping during lockdown continues, possibly piling more pressure on High Streets that have already suffered a wave of closures. Tracy Harvey, managing director of the independent department store Harveys of Halifax, says customers are set for a \"quite different\" experience when they return on Monday.  The five-storey shop will be opening just two floors initially. But it won't be just shoppers who have to do things differently, she told the BBC. \"Some of our staff have been working in the building for 30 years. We've done training, but breaking the habits of a lifetime is going to be challenging. We naturally do things without thinking sometimes, so it will be a challenge.\" Harveys is the sort traditional department store where some customers come in every day, she said. \"We know our customers' names. We are now asking out staff to interact with them in a very different way. It's going to take some getting used to.\" Tracy intends to keep the number of customers in the store at any one time to a bare minimum. \"We could get more people in, but we have decided to keep the numbers low so that the people who are in can walk around and explore more freely rather than be dictated to every step of the way.\" The British Retail Consortium (BRC), the trade body representing the sector, warned that the unlocking was unlikely to provide any immediate boost for the sector.  Helen Dickinson, BRC chief executive, said: \"Retailers have been under immense pressure for the past three months but the reopening of non-essential shops is unlikely to deliver immediate relief. A mix of low consumer confidence and limits on the number of people able to enter stores mean that many shops will continue to suffer lower footfall - and lower sales - for some time to come.\" She called on the government to help stimulate demand with a short-term cut in VAT or a temporary income tax cut for lower-income workers. Prime Minister Boris Johnson said on Sunday he did not know whether to expect \"a flood or a trickle\" when the shops reopened but that he hoped people would return in \"sensible\" numbers. \"I think people should shop and shop with confidence, but they should of course observe the rules on social distancing and do it as safely as possible,\" he said. In Northern Ireland, non-essential shops reopened on Friday, but there is still no date for Wales and Scotland. In England, pubs, restaurants, hairdressers, hotels and cinemas won't be allowed to open their doors until 4 July at the earliest - and even then, only if they can meet social distancing measures. Key to a successful reopening of the economy is the two-metre social distancing rule, the hospitality industry says. Pubs and restaurants have warned that they cannot make money if customers are required to keep two-metres apart, and have urged that the distance limit be reduced to one metre. Mr Johnson has commissioned a review into two-metre distancing, saying there was \"margin for manoeuvre\" as the number of coronavirus cases falls. The government is under intense pressure to get the economy moving as fears grow of a new wave of job losses as furlough scheme that has supported eight million workers is wound down. On Sunday, Chancellor Rishi Sunak acknowledged that more redundancies were inevitable. \"Primarily we need to reopen our economy safely and slowly. That is the most important thing to try and safeguard as many of those jobs as possible,\" he told The Andrew Marr Show. But he warned: \"There is going to be hardship ahead. People are going to lose their jobs.\""
    }
][
    {
        "title": "Rayshard Brooks' final moments were caught on video. Here's what the footage shows",
        "url": "http://us.cnn.com/2020/06/14/us/rayshard-brooks-videos-final-moments/index.html",
        "image": "https://cdn.cnn.com/cnnnext/dam/assets/200613210430-05-rayshard-brooks-super-tease.jpg",
        "content": " Brooks' death not only sparked protests this weekend, but also prompted the sudden resignation of Atlanta Police Chief Erika Shields. The officer who shot Brooks, identified by police as Garrett Rolfe, has been fired, and a second officer involved in the encounter, Devin Brosnan, has been placed on administrative duty. CNN has reached out to the officers and police union for comment. \"There is a clear distinction between what you can do and what you should do,\" Mayor Keisha Lance Bottoms said in a news conference Saturday. \"I do not believe this was a justified use of deadly force.\" Plenty of questions are unanswered, perhaps chief among them whether the officers will face charges. But several videos that captured Brooks' final moments in a Wendy's parking lot Friday night at least shed some light on how the 27-year-old father was killed.  Here's what the videos -- filmed by surveillance cameras, police body cameras, dashboard cameras and bystanders -- show. The initial encounter According to the George Bureau of Investigation, police responded to the Wendy's following reports that a man was asleep in his vehicle in the drive-thru.  The beginning of the incident is seen in footage from a body camera worn by Brosnan. The footage shows the officer arriving at the scene and approaching Brooks' vehicle in the drive-thru line. According to the timestamp on the camera, it's just after 10:40 p.m. ET on Friday.  Brooks is apparently asleep behind the wheel, and Brosnan knocks on the window to wake him up. The officer opens the door and says to Brooks, \"Hey man, you're parked in the middle of the drive-thru line here.\" At first, Brooks does not appear to respond. When he does wake up, Brooks appears disoriented and incoherent. Brosnan asks whether he's tired and then tells Brooks to pull over into a parking spot. Eventually, Brooks moves the vehicle after some more prodding from the officer, who had to wake Brooks a second time.  Brosnan approaches Brooks' parked vehicle and asks him whether he's been drinking. Brooks tells the officer he had only one drink. As Brooks searches for his license, Brosnan radios to make several requests for another officer to conduct a DUI test. At one point, Brooks tells Brosnan that he's visiting. \"Who are you visiting?\" the officer asks. \"My mother's gravesite,\" Brooks says.  \"Oh, I'm sorry to hear that,\" Brosnan says.  A few minutes later, Rolfe arrives on the scene. After a quick explanation from Brosnan, Rolfe begins questioning Brooks as to how he got there. Brooks insists he doesn't remember being in the drive-thru line, and it appears he doesn't know where he is.  A few minutes after 11 p.m., Rolfe begins a field sobriety test. Brooks asks, \"What should I do, sir?\"  After several tests, Rolfe asks Brooks how he feels on a scale of 1 to 10.  \"I feel kind of good, sir,\" Brooks says.  Rolfe then uses a Breathalyzer on Brooks, who explains he had been drinking and that it was his daughter's birthday. \"I think you've had too much to drink to be driving,\" Rolfe says. \"Put your hands behind your back.\"  According to the body camera footage, it's 11:23 p.m. The struggle But as Rolfe attempts to handcuff Brooks, a struggle ensues.  It's hard to discern what's happening in footage captured by cameras worn by Brosnan and Rolfe. Both body cameras fall off in the altercation.  But dashcam footage from the officers' cruisers shows the three men on the ground struggling with each other. The footage from Rolfe's dashcam shows Brosnan readying his Taser as Rolfe holds Brooks from behind.  \"You're going to get Tased,\" one of the officers says.  Another video filmed by a bystander in the drive-thru begins shortly after the struggle starts and shows Brooks grab the stun gun. \"Hands off the f***ing Taser,\" one of the officers says. \"Hands off the Taser.\"  The struggle continues as one of the officers says, \"Stop fighting.\"  Eventually, Brooks gets hold of the Taser and breaks free. As he stands up, he hits Rolfe in the face.  Rolfe steps back and unsheaths his own Taser, which he fires on Brooks as the man runs away, with Rolfe close behind. The shooting Only one camera, a surveillance camera from outside the Wendy's, captured what the others did not: the moment the encounter turned fatal. In the surveillance video released by the GBI, most of Brooks' encounter with the police occurs just out of frame.  But as Brooks runs from the officers, he comes into view of the surveillance camera, followed by Rolfe. Both are carrying Tasers.  As he follows Brooks, Rolfe is seen switching the Taser from his right hand to his left, and reaching for his gun.  At that moment, Brooks turns back and appears to point the Taser at Rolfe, who unholsters his handgun and fires.  The footage shows Brooks fall to the ground. While the surveillance camera filmed the moment Brooks fell, it did not include sound. But all the other cameras captured the sound of three gunshots.  The surveillance footage shows cars in the drive-thru pull into parking spots. Some of the drivers step out of their vehicles and film the scene. After a few moments, the officers attempt CPR. More officers and an ambulance soon arrive. Body camera footage also captured audio of bystanders berating the officers, with one telling them, \"Both of your careers are definitely done, because you just shot a man, for no reason.\"  Brooks was taken to a hospital, where he died, according to the GBI, which is investigating the incident at the request of the Atlanta Police Department.  L. Chris Stewart, an attorney for Brooks' family, said the officers did not have to shoot Brooks, adding that a Taser is not a deadly weapon.  \"If the officer had been a bit more empathetic and a bit less scared, we probably wouldn't have a dead client,\" Stewart said."
    }
]