[
    {
        "title": "About 8,800 unaccompanied children expelled at U.S. border under coronavirus-related measure",
        "url": "https://www.nbcnews.com/politics/immigration/about-8-800-unaccompanied-children-expelled-u-s-border-under-n1239945",
        "image": "https://media4.s-nbcnews.com/j/newscms/2020_37/3411630/200911-deported-wave-bus-jm-2148_3206f876551808062c79cde9aa11b8ac.nbcnews-fp-1200-630.jpg",
        "content": " SAN FRANCISCO — About 8,800 unaccompanied children have been quickly expelled from the United States along the Mexico border under a pandemic-related measure that effectively ended asylum, authorities said Friday. The Trump administration has expelled more than 159,000 people since the U.S. Centers for Disease Control and Prevention emergency order took effect in March, a figure that also includes more than 7,600 adults and children who crossed the border in families. This site is protected by recaptcha Privacy Policy | Terms of Service The figures on children were reported for the first time in a declaration by Raul Ortiz, the Border Patrol's deputy chief, as part of the administration's appeal of an order to stop housing children in hotels. The administration “immediately” expelled most children and families to Mexico but more than 2,200 unaccompanied children and 600 people who came in families were held until flights could be arranged to return home, Ortiz said. The administration asked the 9th U.S. Circuit Court of Appeals to overturn a ruling last week that found use of hotels skirted “fundamental humanitarian protections.” U.S. District Judge Dolly Gee in Los Angeles ruled that using hotels for long-term detention violated a two-decade-old settlement governing treatment of children in custody. She ordered border agencies to stop placing children in hotels by Tuesday. Justice Department attorneys argued that settlement doesn't apply during the public health emergency and that hotels were appropriate. “While in these hotels, the government provides minors with supervision by specialists, recreation, amenities, and protective measures against COVID-19,” the attorneys wrote. Before the pandemic, unaccompanied children were sent to state-licensed shelters operated by the Department of Health and Human Services and often released to family members while seeking asylum.",
        "predicted_topic": "politics"
    },
    {
        "title": "'Glee' actor Naya Rivera called for help as she drowned in California lake, autopsy finds",
        "url": "https://www.nbcnews.com/pop-culture/pop-culture-news/glee-actor-naya-rivera-called-help-she-drowned-california-lake-n1239934",
        "image": "https://media1.s-nbcnews.com/j/newscms/2020_29/3396627/200713-naya-rivera-se-107p_b04494da0182c3026cc66e24d9e9986f.nbcnews-fp-1200-630.jpg",
        "content": " LOS ANGELES — An autopsy report released Friday says “Glee” actor Naya Rivera raised her arm and called for help as she accidentally drowned while boating with her 4-year-old son on a California lake. Once his mother had helped him back on to the boat, the boy “noticed the decedent put her arm up in the air and yelled ‘help,’ the report from the Ventura County Medical Examiner says. “The decedent then disappeared in to the water.” Authorities had previously said that Rivera had drowned accidentally after putting the boy, Josey Hollis Dorsey, back on the boat at Lake Piru northwest of Los Angeles on July 8, but had not mentioned her shouting for help. Rivera “knew how to swim well,” the report said. This site is protected by recaptcha Privacy Policy | Terms of Service The man who rented her the pontoon boat said she declined a life vest, but he put one aboard anyway. It revealed that the 33-year-old Rivera had previous problems with vertigo, had a recent sinus infection, and had a small amount of prescribed amphetamines in her system, but did not identify physical conditions or drugs as factors in her death. Toxicology tests also showed she had small, therapeutic amounts of the anti-anxiety drug diazepam and the appetite suppressant phentermine in her system. Josey, Rivera's son with her former husband, actor Ryan Dorsey, was found sleeping and alone on the drifting boat later that afternoon. Five days later, her body was found floating in an area of the lake that is about 30 feet deep. The Ventura County Sheriff's Office said she was most likely trapped in thick vegetation underwater for several days before floating to the top. Josey was immediately reunited with his father and other relatives. The day before her death, Rivera tweeted a photo of the two of them that read, “just the two of us.” In her memoir, she called him “my greatest success, and I will never do any better than him.” Rivera's death was the third of a major cast member of “Glee,” the Fox TV musical comedy that Rivera starred in from 2009 to 2015, playing a singing and dancing lesbian cheerleader. Rivera's body was found seven years to the day after co-star Cory Monteith died at 31 from a toxic mix of alcohol and heroin. Another co-star, Mark Salling, who Rivera dated at one point, killed himself in 2018 at age 35 after pleading guilty to child pornography charges.",
        "predicted_topic": "entertainment"
    },
    {
        "title": "Afghan peace talks with Taliban set to begin",
        "url": "http://www.bbc.co.uk/news/world-asia-53976968",
        "image": "https://ichef.bbci.co.uk/news/1024/branded_news/12F91/production/_114331777_d0f8cde8-974d-4c72-92c9-c55db3823a73.jpg",
        "content": " The first peace talks between the Afghan government and the Taliban are due to begin in the Gulf state of Qatar on Saturday, after months of delay. US Secretary of State Mike Pompeo called the meeting historic as he flew to Doha for the opening ceremony. The talks were due to start after a US-Taliban security deal in February. But disagreements over a controversial prisoner swap stalled the next stage, as did violence in Afghanistan, where four decades of war are at a stalemate. A delegation of leading Afghans left Kabul for Doha on Friday - 11 September, the day 19 years ago of the deadly attacks on the US which led to the end of Taliban rule. The head of the delegation, Abdullah Abdullah, said they were seeking a just and dignified peace. On Thursday the Taliban confirmed they would attend, after a final group of six prisoners were released. These are the first direct talks between the Taliban and representatives of the Afghan government. The militants had until now refused to meet the government, calling them powerless and American puppets. The two sides are aiming for political reconciliation and an end to decades of violence, which began with the 1979 Soviet invasion. The talks were meant to begin in March but were repeatedly delayed by a dispute over the prisoner exchange agreed in the February US-Taliban deal, as well as violence in the country. The separate but linked US-Taliban agreement set out a timetable for the withdrawal of foreign forces, in exchange for counter-terrorism guarantees. That agreement took over a year to finalise, and the government-Taliban talks are expected to be even more complicated. Many worry that fragile progress made in women's rights could be sacrificed in the process. The talks also present a challenge to the Taliban, who will have to bring forward a tangible political vision for Afghanistan. They have so far been vague, stating they wish to see an Islamic but also inclusive government. The talks may provide more evidence of how the militant group has changed since the 1990s, when they ruled using a harsh interpretation of Sharia law. You can feel the buzz in the glittering great halls of the Sheraton Grand Doha hotel: Afghan negotiators, officials, journalists rushing in from their chartered flight from Kabul; foreign diplomats who've spent years inching towards this moment now hurrying to and fro; and a few Taliban slipping through the crowds on the eve of the big day. It's been a long time coming in a war which exacts such a heavy price. There's anticipation. Apprehension too. All that's certain is after an opening ceremony with hours of speeches - the show as some call it - there will be Afghan talks. How long they will talk this time, about what, and in which way, is still uncertain. Everyone emphasises these are Afghan decisions. And there's no agreement yet, even within each side. It's the start of a protracted process with no certainty of success. But even a start is something in a war which seems endless. The US and its Nato allies agreed to withdraw all troops within 14 months, while the Taliban committed not to allow al-Qaeda or any other extremist group to operate in the areas they control. The US also agreed to lift sanctions against the Taliban and work with the UN to lift its separate sanctions against the group, as well as cutting its troop numbers in the country from about 12,000 to 8,600 and closing several bases. US-led troops have been present in Afghanistan for nearly two decades, after launching air strikes to oust the Taliban in 2001 following the deadly 9/11 al-Qaeda attacks in New York. The Taliban, who protected al-Qaeda leader Osama Bin Laden, had refused to hand him over. The Afghan government did not take part in the February accord, but had expected to begin peace talks with the Taliban in March. The deal also provided for a prisoner swap of about 5,000 Taliban prisoners and 1,000 detained Afghan security personnel to be finalised before the planned start of the March talks. Government and Taliban negotiators disagreed over the numbers of prisoners to be freed and who they would be. The continuing violence also held things up. Some of the men the Taliban wanted freed were commanders believed to have been involved in major attacks. We cannot release the killers of our people, a government negotiator said at the time. According to a report by the Washington Post last month, three Afghans accused of involvement in the deaths of US troops were also a sticking point. Progress was slow, but in August the Afghan government began to free the final 400 Taliban prisoners, after the move was approved by a grand assembly, or loya jirga of elders. Not all of the group of 400 were released straight away, after both France and Australia objected to freeing six prisoners accused of fatal attacks against their nationals, including humanitarian workers. Their release and transfer to Doha on the eve of talks removed the final hurdle. At 19 years, the conflict in Afghanistan - codenamed Operation Enduring Freedom and later Operation Freedom's Sentinel - has been the longest in US history. At the outset in 2001, the US was joined in its fight by an international coalition, and the Taliban were quickly removed from power. But the militant group morphed into an insurgent force that dug in and launched deadly attacks against US-led forces and the Afghan military, as well as Afghan government officials. The international coalition ended its combat mission in 2014. The total coalition death toll by that point was nearly 3,500. More than 2,400 US military personnel have been killed. The UK lost more than 450 of its soldiers. The Watson Institute at Brown University estimated in November 2019 that more than 43,000 civilians had been killed, with 64,000 Afghan security personnel and 42,000 anti-government fighters dead. The true numbers will never be known. The US continued its own, scaled-back combat operation after 2014, including air strikes. The Taliban meanwhile continued to gain momentum and now control more territory than at any time since 2001. ",
        "predicted_topic": "politics"
    },
    {
        "title": "I read all those Trump tell-alls. Here's what I learned",
        "url": "http://www.bbc.co.uk/news/world-us-canada-53970246",
        "image": "https://ichef.bbci.co.uk/news/1024/branded_news/48F9/production/_114318681_trumpphotoshop.jpg",
        "content": " Hardly a day goes by without another book about the Trump White House - by a devoted former aide or a disgruntled ex-employee. Together, what do they tell us about the man? Has there ever been a presidency like this? the author of one of the many, many books about President Donald Trump is asked. I assured him there had not, was the reply. Trump, the high-profile businessman and reality star who upset the odds to become president, was always going to be a popular literary subject. And those books keep on coming. This week alone saw headline-making additions to an already creaking bookcase from veteran journalist Bob Woodward and Trump's ex-lawyer Michael Cohen. There have been blockbuster works from reporters, family tell-alls and there is a whole industry of pro-Trump books from conservative authors. But this round-up focuses on works by those who worked with Trump either during the campaign or in the White House. It is a long cast list: The books are by their very nature partial, and given the accounts often depend on reports of private conversations, we only have the author's word to go on that they took place. Those writing sympathetically have been painted as apologists looking for a way back in, while the critical writers have been accused of holding a grudge. But taken together, what do you get? Whatever the author's final verdict of Trump is, there is a major recurring theme. Donald Trump has a fierce code of loyalty, writes Spicer. Nothing hurts him deeper than when someone he trusts is disloyal, says Lewandowski and Bossie. Loyalty was the key factor in appointments, Bolton says. Cohen, in Disloyal, and Comey, in A Higher Loyalty, build their titles around this concept. Comey's book - part memoir, part leadership study, part expose - hints at the moment Trump reportedly told him I need loyalty. I expect loyalty, when Comey was FBI director. Comey says he refused. He did not last much longer in his job. In Trump's world loyalty is the currency that decides who survives and who has the ear of the president. Sometimes, it spills into policy. In his account of the Trump administration's dealings with Venezuela, Bolton quotes Trump as saying of opposition leader Juan Guaidó: I want him to say he will be extremely loyal to the United States and no one else. But for most loyalty in Trump's world is a one-way street. As Sims notes in the final chapter of his book: I had let my personal relationship to the president blind me to the one unfailing truth that applied to anyone with whom he didn't share a last name: we were all disposable. A demand for loyalty is partly why several authors compare Trump to a mob boss. At least when Comey and McCabe do it they have some authority, having spent their careers in law enforcement. He got off lightly with that particular comparison. To Anonymous, Trump is like a 12-year-old in an air traffic control tower. Comey says his leadership is a forest fire. Omarosa, whose book even by Trump memoir standards takes few prisoners, calls him a racist, a bigot and a misogynist. In his corner Trump can count on Christie, who says he was everything I was - but on jet fuel. Most memorably of all, Spicer says Trump is a unicorn, riding a unicorn over a rainbow. There is a very little common ground in the books between what Trump's supporters and his detractors say about his character. To the admiring voices he is a man of charisma, sharp instinct and political skill. To them his unique speaking style - while occasionally exasperating - is a gift. Trump knew how to speak to the people, says Lewandowski and Bossie. Spicer quotes his father as saying: Many candidates say something like, 'I will fight for policies that will create a better economy,' while Trump says 'I'm going to get your job back. Elsewhere, of all the character traits that Trump most liked to tout about himself, the boasts about his 'energy' and 'stamina' were the most undeniably true, Sims says, a point others make too and one which goes some way to explain why lethargy is a favourite angle of attack for Trump against his opponents. No one says that there is a radically different side to Trump when the cameras are switched off - Sims says there isn't really a private version of him. But there are stories of him letting his guard down, such as, for once, going quiet on election night as news of his win came in (Christie). Others talk about phone calls offering condolences after the deaths of loved ones, his affection for his family or warmth for US military members. In Sanders' telling, Trump meets a soldier while on a Christmas visit to Iraq. A member of the US Army told him he re-joined the military because of him, and the president said: 'And I am here because of you.' Put it this way - it is only Spicer who talks about unicorns. Omarosa says Trump has a total lack of empathy, which is itself a function of extreme narcissism. McCabe calls him the most prolific liar I have ever encountered. Anonymous describes Trump as ignorant, intellectually lazy and with such a short attention span all but impossible to brief. One adviser in the book says the president's demands fall into three categories - the flat-out stupid, the impossible to implement and the flat-out illegal. Until we know who the author is, though, there will always be question marks over the book's contents. Less easy to dismiss is Bolton's book, who is the most senior figure yet from the Trump administration to write their memoirs. His role as national security adviser gave him a seat at the table and a say in some of the most important events in the Trump presidency. In his book Bolton says Trump sought help from Chinese President Xi Jinping to win re-election, by urging China to buy agricultural products from farmers in key states. Later in the book Bolton says Trump couldn't tell the difference between his personal interests and the country's interests. There are several examples of Trump cosying up to authoritarians: Bolton says he had a habit of giving personal favours to dictators he liked, and was easily manipulated by them. He describes a letter from North Korean leader Kim Jong-un as like it had been written by Pavlovians who knew exactly how to touch the nerves enhancing Trump's self-esteem and at one summit not looking forward to leaving him alone with Russia's Vladimir Putin. To Sims everything was personal to Trump - everything. In international affairs, he believed his personal relationship with foreign leaders was more important than shared interests or geopolitics. Sims sees Trump as a man of extraordinary talents and stunning shortcomings. With apologies to the authors, who use their books to also tell of motherhood, their professional achievements, or to quote the founding fathers, it is hard to resist not reducing each to one stand-out anecdote. In Omarosa it is the moment Trump asks if he can swear-in to office using a copy of the Art of the Deal. She says he wanted me to believe he was kidding. Sanders describes the moment the US president tried to help out North Korea's Kim improve his oral hygiene. As the lunch was starting the president offered Kim a breath mint. 'Tic Tac?' Kim, confused, and probably concerned it was an attempt to poison him, wasn't sure how to respond. The president dramatically blew into the air to reassure Kim it was just a breath mint. But the capo di tutti capi, the one-anecdote-to-rule-them-all, goes to Sims, who says that a small wooden box with a red button inside can often be found on the president's desk in the Oval Office. If Trump noticed someone glancing at the box... he would pick it up and move it further away from himself. 'Don't worry about that,' he'd say. 'No one wants me to push that button.' Guests would laugh nervously and the conversation would continue, until several minutes later Trump would suddenly move it closer to him without actually saying anything about it. Then, later in the conversation, out of nowhere, he'd suddenly press the button. Not sure what to do, guests would look at one another with raised eyebrows. Moments later, a steward would enter the room carrying a glass filled with Diet Coke on a silver platter, and Trump would burst out laughing. Trump is often photographed wearing his tie unusually long, with the tip dipping below his waist line. The reason, according to Christie, is that he believes it makes him looks thinner. As for that famous shock of hair, Sims says he always carried a can of hairspray in his pocket should the presidential coiffure need a touch-up. There is a tanning bed in the White House for the president's use, Omarosa says, who also alleges that an usher was fired as Trump didn't approve of her handling of it. Elsewhere we read that Trump thinks that November Rain by Guns N' Roses is the greatest music video of all time (Sanders) and was obsessed with sending a CD of Elton John's Rocket Man to North Korean leader Kim Jong-un (Bolton). Beyond briefing documents and newspapers, the president is not described as a keen book reader. Scaramucci, though, names All Quiet on the Western Front as Trump's favourite, while Lewandowski / Bossie say Swiss psychologist Carl Jung's autobiography is another one liked by the president. For those who worked for Trump but later turned on him, why did you stick with him? For Omarosa it was a matter of loyalty, even, amongst other criticisms, as she felt that as a black woman working in an administration low on diversity she offered political cover. For others there is a sense the loyalty was towards the Republican party, and an agenda, rather than the president himself. Partisanship shouldn't be underestimated. As Sanders puts it, about joining the campaign: It was going to be Trump or Hillary - help save the country or let it go to hell. Bolton says he knew of the risks in store, but felt he could handle it. The two were something of an odd couple - Trump vowed to stop endless wars yet appointed a man of whom he reportedly said has never seen a war he doesn't like. Bolton's time in the administration saw aggressive policies against Iran, Venezuela and others. His regret is that they weren't aggressive enough. In the grand tradition of memoirs, errors are acknowledged then the responsibility dodged. The Trump campaign and White House comes across as extraordinarily fratricidal. Most of the books, particularly from Trump staffers, include lengthy attacks on other Trump staffers. Some argue the wrong people in the wrong job explains some of the missteps, rather than the buck stopping with the president. On arriving at the White House, Bolton is warned by then chief of staff John Kelly this is a bad place to work, as you will find out. Spicer and Sanders attack the press. Trump has never received anywhere near the appropriate credit from the mainstream media for his successes, as Spicer says. There's also a sense of Trump's officials holding back at key moments. Bolton at several points says he considered resigning but in his telling it took a dressing down over collapsed talks with the Taliban that was the final straw. Both Comey and McCabe describe and regret times they did not stand up to him. Recounting a bizarre meeting, in which the president asked him who he voted for, McCabe asks himself: Should I have been more confrontational? .... Even when it's Donald Trump it is still President Trump. So the reflex, the automatic response I felt from the deepest part of myself, was to be respectful and responsive. These books aren't the obvious place to find predictions of how November will pan out. Notably lots of them begin with the author being fired or resigning, so they can't claim to have the ear of the White House. You do get a hint or two though. Rallies have a central place in Trump's world, as a source of energy and an instant focus group for him to sharpen his message. That stunning win in 2016 is one he wants to repeat - and one he wants to savour. I'd sense the tension I believe nags Trump the most, at least subconsciously: nothing about being president has ever reached the high of becoming president, says Sims. The title and theme of Lewandowski / Bossie's book, Let Trump Be Trump, allude to their portrait of a man who is not going to change, and nor should he, they say, given his success last time. With Joe Biden still enjoying a lead in the polls, perhaps the best lesson comes from Christie, who Trump defeated on the way to victory in 2020. As someone who ran against him, I know this much: underestimate him at your peril.",
        "predicted_topic": "politics"
    },
    {
        "title": "Treasury Department withholds $1.5 million from FDNY 9/11 health program",
        "url": "http://us.cnn.com/2020/09/11/politics/treasury-fdny-9-11-health-program/index.html",
        "image": "https://cdn.cnn.com/cnnnext/dam/assets/200113112038-01-us-treasury-file-super-tease.jpg",
        "content": " The Republican congressman wrote to Treasury Secretary Steven Mnuchin in June and on September 10, urging him to reimburse the FDNY's World Trade Center Health Program for its services. He wrote that the department apparently withheld the funding due to a range of issues dealing with different New York City offices and programs that have nothing to do with the FDNY Clinic. It is essential that you release these funds immediately to the FDNY's World Trade Center Clinic, King wrote to Mnuchin in September. Our firefighters should not (be) punished for an administrative issue with New York City's Department of Finance. The New York Daily News first reported that the Treasury Department withheld nearly $4 million over the past four years, including nearly $1.5 million this year through late August. FDNY spokesman Frank Dwyer told CNN that the Daily News article is accurate. But Frederick Vaughan, a Treasury Department official, told King's office in August that between August 2016 and May 2020, the department withheld nearly $2 million from FDNY. Vaughan wrote that the Treasury Department is required to offset federal payments for debts owed to the US, and since New York City has a single taxpayer identification number that covers multiple programs, FDNY's World Trade Center Health Program offset the debt of another. King wrote that the department withheld the payments without informing FDNY, which he said noticed the discrepancies in their reimbursements over a year ago, and urged the department again in September to address the issue. The Treasury Department is currently working with New York City to do so, according to a Trump administration official. Treasury adhered to its statutory obligations established by Congress regarding debts owed by New York, the official said. But we are also working with Congressman King and others to examine any potential authorities to provide relief in this case to support our nation's 9/11 heroes.",
        "predicted_topic": "business"
    }
]